{
    "meta.title": "Správce harvestoru",
    "no-value": "-",
    "error": "Něco se pokazilo",
    "resultCount": "{count, number} {count, plural, one {nalezený záznam} other {nalezených záznamů}}",
    "add": "Přidat",
    "actions.new": "Nový záznam",
    "actions.new.harvestable.oaiPmh": "Harvestové OAI-PMH",
    "actions.new.harvestable.xmlBulk": "Hromadně harvestovatelné XML",
    "actions.new.harvestable.connector": "Harvestový konektor",
    "actions.new.harvestable.status": "Výstup o stavu lze harvestovat",
    "nav.harvestables": "Harvestované",
    "button.edit": "Upravit",
    "button.delete": "Smazat",
    "button.start-job": "Spustit úlohu",
    "button.stop-job": "Zastavit úlohu",
    "button.confirm": "Potvrdit",
    "op.delete.confirm": "Opravdu chcete tento záznam smazat?",
    "op.delete.completed": "Záznam <b>{name}</b> smazán",
    "op.run.completed": "Úloha <b>{name}</b> zahájena",
    "op.stop.completed": "Úloha <b>{name}</b> zastavena",
    "harvestables.column.name": "Název",
    "harvestables.column.currentStatus": "Stav",
    "harvestables.column.lastHarvestFinished": "Dokončen poslední harvest",
    "harvestables.column.enabled": "Zprovozněno?",
    "harvestables.column.jobClass": "Třída úlohy",
    "harvestables.column.id": "ID",
    "harvestables.column.message": "Zpráva (zpracována/načtena/smazána(přeskočena)/neúspěšná)",
    "harvestables.column.enabled.true": "Ano",
    "harvestables.column.enabled.false": "Ne",
    "harvestables.column.jobClass.OaiPmhResource": "OAI-PMH",
    "harvestables.column.jobClass.XmlBulkResource": "Hromadné XML",
    "harvestables.column.jobClass.HarvestConnectorResource": "Konektor harvestoru",
    "harvestables.column.jobClass.StatusResource": "Výstup o stavu",
    "harvestables.column.currentStatus.NEW": "Nový",
    "harvestables.column.currentStatus.OK": "OK",
    "harvestables.column.currentStatus.WARN": "Varování",
    "harvestables.column.currentStatus.ERROR": "Chyba",
    "harvestables.column.currentStatus.RUNNING": "Spuštěné",
    "harvestables.column.currentStatus.FINISHED": "Dokončeno",
    "harvestables.column.currentStatus.KILLED": "Zastaveno",
    "harvestables.index.name": "Název",
    "harvestables.index.id": "ID",
    "harvestables.index.message": "Zpráva",
    "searchInputLabel": "XXX searchInputLabel",
    "accordion.devinfo": "Informace pro vývojáře",
    "harvestables.heading.general": "Obecné informace",
    "harvestables.field.id": "Id",
    "harvestables.field.id.help": "Automaticky přiřazený identifikátor pro úlohu",
    "harvestables.field.name": "Název",
    "harvestables.field.name.help": "Nejlépe jedinečný název, podle kterého mohou uživatelé identifikovat tento prostředek Harvestor. V některých případech může být název navržen po vyplnění oddílu konfigurace specifického protokolu (např. Index Data Connectors, OAI-PMH).",
    "harvestables.field.serviceProvider": "Poskytovatel služeb",
    "harvestables.field.serviceProvider.help": "Pole s volným textem používané zaměstnanci podpory pro záznam administrativních informací. Nepoužívaný harvestorem.",
    "harvestables.field.usedBy": "Použito",
    "harvestables.field.usedBy.help": "Pole s volným textem pro označení úlohy cílovou skupinou, například skupinou uživatelů nebo zákazníkem zdroje. Více štítků uživatelů/zákazníků lze oddělit čárkami. Tyto štítky lze použít pro filtrování výstupů o stavu podle využití/zákazníků.",
    "harvestables.field.managedBy": "Spravovaný",
    "harvestables.field.managedBy.help": "Pole volného textu pro označení úlohy výrobcem nebo správcem zdroje. Více štítků lze oddělit čárkami. Tyto štítky mohou správci úloh použít k filtrování výstupů o stavu.",
    "harvestables.field.openAccess": "Zdroj s otevřeným přístupem?",
    "harvestables.field.description": "Popis obsahu",
    "harvestables.field.description.help": "Pole s volným textem používané zaměstnanci podpory pro záznam administrativních informací. Nepoužívaný harvestorem.",
    "harvestables.field.technicalNotes": "Technické poznámky",
    "harvestables.field.technicalNotes.help": "Pole s volným textem používané zaměstnanci podpory pro záznam administrativních informací. Nepoužívaný harvestorem.",
    "harvestables.field.contactNotes": "Kontaktní poznámky",
    "harvestables.field.contactNotes.help": "Pole s volným textem používané zaměstnanci podpory pro záznam administrativních informací. Nepoužívaný harvestorem.",
    "harvestables.field.enabled": "Úloha harvestu povolena?",
    "harvestables.field.enabled.help": "Zaškrtněte, aby se úloha harvestu spustila podle času/intervalu vybraného v poli \"Rozvrh harvestu\". Pokud toto políčko necháte nezaškrtnuté, úloha bude neaktivní.",
    "harvestables.field.scheduleString": "Rozvrh harvestu",
    "harvestables.field.scheduleString.help": "Pomocí těchto polí můžete definovat opakující se čas/interval, ve kterém by se měla úloha Harvestoru spustit. Např. pro týdenní spuštění určete den v týdnu, kdy má být harvest spuštěn.",
    "harvestables.field.scheduleString.harvest": "Harvest",
    "harvestables.field.scheduleString.day": "(den) z",
    "harvestables.field.scheduleString.month": "(měsíc), pokud je",
    "harvestables.field.scheduleString.weekday": "(den v týdnu)",
    "harvestables.field.scheduleString.time": "Doba harvestu",
    "harvestables.field.scheduleString.hour": "(hodina, 24 hod. formát)",
    "harvestables.field.scheduleString.minute": "(min)",
    "harvestables.field.transformationPipeline": "Transformační kanál",
    "harvestables.field.transformationPipeline.help": "Vyberte vyžadovanou transformaci, aby odpovídala vstupnímu formátu dodanému zdroji vnitřního formátu používanému Harvestorem pro ukládání dat. Další podrobnosti naleznete v příručce Transformační kanál.",
    "harvestables.field.laxParsing": "Použijte laxní rozbor (pokud je to možné)",
    "harvestables.field.laxParsing.help": "Je-li povoleno, harvestor se pokusí analyzovat chybně formátovaný XML (chybějící uzavírací štítky, entity)",
    "harvestables.field.encoding": "Přepsání kódování (ISO-8859-1, UTF-8, ...)",
    "harvestables.field.encoding.help": "Kanál může vracet odpovědi s nesprávným kódováním, například může mít hlavičku XML s kódováním nastaveným na UTF-8, ale ve skutečnosti vrací v datech kódování ISO-8859-1. Nastavení tohoto pole na skutečné kódování donutí Harvester použít zadané kódování.",
    "harvestables.field.storage.name": "Úložiště",
    "harvestables.field.storage.name.help": "Vyberte typ úložiště a lokaci pro harvestovaná data. Harvestor má vrstvu abstrakce úložiště, která mu umožňuje pracovat s více potenciálními systémy pro ukládání záznamů, ale v současnosti je podporován pouze Solr/Lucene. Po výběru Úložiště je možné zobrazit indexované záznamy kliknutím na pole Uložené záznamy: kliknutím zobrazíte.",
    "harvestables.field.storageBatchLimit": "Limit skladovací dávky",
    "harvestables.field.cacheEnabled": "Mezipaměť na disku?",
    "harvestables.field.cacheEnabled.help": "Pokud je tato možnost povolena, data harvestu se uchovávají v mezipaměti souborového systému a úlohu lze znovu spustit z této mezipaměti, aniž by bylo nutné se vracet na server.",
    "harvestables.field.storeOriginal": "Uložit původní obsah záznamu?",
    "harvestables.field.recordLimit": "Omezit počet záznamů na",
    "harvestables.field.recordLimit.help": "Omezte harvest na zadaný počet záznamů: užitečné pro testování nastavení úloh a transformačních kanálů.",
    "harvestables.field.timeout": "Časový limit připojení/čtení (v sekundách)",
    "harvestables.field.timeout.help": "Zadejte jinou než výchozí hodnotu časového limitu pro získání a čtení ze síťového připojení (soketu). Hodnoty pod 1 minutu se nedoporučují.",
    "harvestables.field.logLevel": "Úroveň logu",
    "harvestables.field.logLevel.help": "Upřesnit úroveň logování úlohy. Přičemž nejpodrobnější je DEBUG. Ve většině případů se doporučuje úroveň logu INFO.",
    "harvestables.field.failedRecordsLogging": "Ukládání neúspěšných záznamů",
    "harvestables.field.failedRecordsLogging.help": "Určete, zda se mají neúspěšné záznamy ukládat jako soubory XML do určeného adresáře logu. Zadejte také pravidla uchovávání pro tento adresář, tj. zda se mají uchovávat soubory, které byly uloženy při předchozích spuštěních, a pokud ano, zda se má stávající soubor přepsat, pokud stejný záznam znovu selže, nebo zda se má k názvu nového souboru raději přidat pořadové číslo, aby se nepřepsal.",
    "harvestables.field.maxSavedFailedRecordsPerRun": "Maximální počet neúspěšných záznamů uložených při příštím spuštění",
    "harvestables.field.maxSavedFailedRecordsPerRun.help": "Nastaví maximální počet souborů, které se mají uložit do adresáře chybných záznamů za běh. O dosažení limitu informuje log úlohy.",
    "harvestables.field.maxSavedFailedRecordsTotal": "Maximální počet uložených neúspěšných záznamů celkem",
    "harvestables.field.maxSavedFailedRecordsTotal.help": "Nastavuje maximální počet souborů, které se mají v daný okamžik uložit do adresáře neúspěšných záznamů – jako součet dříve uložených záznamů (které nebyly před tímto spuštěním vyčištěny) plus všech nových záznamů přidaných během běhu. Log úlohy sdělí, kdy je dosaženo limitu.",
    "harvestables.field.mailAddress": "E-mailové adresy pro oznámení",
    "harvestables.field.mailAddresses": "E-mailové adresy pro oznámení",
    "harvestables.field.mailAddresses.help": "Seznam e-mailových adres, které mají obdržet oznámení o dokončení úlohy.",
    "harvestables.field.mailLevel": "Odeslat oznámení, pokud je alespoň závažnost",
    "harvestables.field.mailLevel.help": "Upřesnit stav dokončení úlohy s nejmenší závažností, která aktivuje oznámení e-mailem.",
    "harvestables.field.constantFields": "Seznam konstantních polí",
    "harvestables.field.constantFields.help": "Seznam párů NAME=VALUE. Pro harvest, který má toto pole nastaveno, má každý harvestovaný záznam každé pole NAME nastaveno na odpovídající VALUE.",
    "harvestables.field.json": "Další konfigurace: (JSON)",
    "harvestables.field.json.help": "Upřesnit dodatečnou pokročilou konfiguraci harvesteru ve formátu JSON.",
    "harvestables.field.type.oaiPmh": "Specifické informace OAI-PMH",
    "harvestables.field.url": "URL úložiště OAI",
    "harvestables.field.url.help": "Zadejte odkaz (založený na protokolu http) na zdroj, který má být získán. Uveďte základní odkaz definovaný názvem setu OAI: (viz níže). Některé zdroje mají v rámci repozitáře více setů. Pokud není v adrese URL identifikována žádná konkrétní sada, bude sklízen celý repozitář.",
    "harvestables.field.oaiSetName": "Název sady OAI (typ pro návrhy)",
    "harvestables.field.oaiSetName.help": "Volitelné nastavení, hodnota OAI-PMH setSpec, která určuje nastavená kritéria pro selektivní sklízení.",
    "harvestables.field.metadataPrefix": "Prefix metadat",
    "harvestables.field.metadataPrefix.help": "Řetězec, který určuje formát metadat v požadavcích OAI-PMH vydaných cílovému repozitáři. Je důležité zvolit správný formát, jinak nebudou z úložiště získána žádná data. Ujistěte se, že je vybrán transformační kanál, který odpovídá formátu metadat používanému v úložišti, jinak harvestor záznamům nebude rozumět. Úložiště obvykle používají jeden z následujících prefixů (nebo vložených datových formátů): (OAI-DC) nebo MARC XML (MARC12/USMARC). Mezi další méně obvyklé hodnoty MetadataPrefix patří PMC (plnotextové záznamy PubMed Central), PMC (metadatové záznamy PubMed Central) a PZ2 (pazpar2).",
    "harvestables.field.dateFormat": "Formát data",
    "harvestables.field.useLongDateFormat": "Použijte formát dlouhého data",
    "harvestables.field.useLongDateFormat.help": "Zaškrtávací políčko, které určuje, zda se má při vyžádání záznamů ze zdroje OAI-PMH použít dlouhý formát data. Toto se nepoužívá příliš často, ale některé zdroje to vyžadují.",
    "harvestables.field.fromDate": "Harvestovat z",
    "harvestables.field.fromDate.help": "Pokud je prázdný a není nastaven žádný token obnovení, harvestor získá z prostředku celou sadu dat. Pokud toto pole obsahuje hodnotu, harvestor po dokončení úlohy vynuluje hodnotu tohoto pole na den předcházející aktuálnímu datu spuštění, takže následující spuštění budou sklízet pouze nové záznamy.",
    "harvestables.field.untilDate": "Harvestovat dokud",
    "harvestables.field.untilDate.help": "Horní hranice data selektivního harvestu. Při po sobě jdoucích spuštěních harvestor toto pole vymaže, čímž se interval data stane neomezeným.",
    "harvestables.field.resumptionToken": "Tokenu obnovení (přepíše datum)",
    "harvestables.field.resumptionToken.help": "Protokol OAI-PMH podporuje rozdělení větších datových setů na menší části. Při doručení části záznamů OAI-PMH vrátí token, který by měl další požadavek použít, aby získal další část. Pokud se úloha OAI-PMH zastaví před dokončením, bude v tomto poli nastaven token obnovení. Někdy je možné jej spustit znovu od tohoto bodu obnovení v pozdější fázi, ale to není vždy podporováno.",
    "harvestables.field.clearRtOnError": "Vymazání tokenu obnovení při chybách připojení",
    "harvestables.field.clearRtOnError.help": "Vymažte token obnovení pro harvest, který se dokončí v chybovém stavu. To je užitečné, když dojde k chybám serveru a poslední token obnovení již není platný.",
    "harvestables.field.keepPartial": "Udržujte částečné harvesty",
    "harvestables.field.keepPartial.help": "Pokud je tato možnost zaškrtnuta, budou v úložišti zachovány dílčí záznamy harvestované během neúspěšného harvestu.",
    "harvestables.field.retryCount": "Počet opakování žádanek",
    "harvestables.field.retryCount.help": "Upřesnit, kolikrát má harvestor opakovat neúspěšné žádosti na harvest, 0 opakování zcela zakáže.",
    "harvestables.field.retryWait": "Zpoždění před opakováním (sekundy)",
    "harvestables.field.retryWait.help": "Zpoždění při opakování neúspěšných žádostí. Změňte pouze v případě, že prostředek nefunguje s výchozími hodnotami.",
    "harvestables.field.type.xmlBulk": "Specifické hromadné informace XML",
    "harvestables.field.urls": "Adresy URL",
    "harvestables.field.urls.help": "Jedna nebo více mezerou oddělených URL (HTTP nebo FTP) pro binární data XML nebo MARC. Jsou podporovány skokové nebo indexové stránky (HTML stránky s URL) a také FTP adresáře. Pro FTP může být níže povoleno sklízení rekurzivních adresářů.",
    "harvestables.field.allowErrors": "Pokračovat v chybách?",
    "harvestables.field.allowErrors.help": "Zaškrtněte, chcete-li pokračovat ve harvestu a ukládání záznamů, i když se načítání některých z uvedených zdrojů nezdaří.",
    "harvestables.field.overwrite": "Přepsat data při každém spuštění (nepřírůstkové)?",
    "harvestables.field.overwrite.help": "Zaškrtnutím této možnosti smažete všechna dříve získaná data před zahájením dalšího rozvrženého (nebo ručně spouštěného) běhu. To lze použít, když jsou na serveru umístěny úplné výpisy katalogu. S FOLIO katalogem nedochází k odstranění všech dříve havestovaných dat a zaškrtnutí této možnosti místo toho znamená, že existující záznamy by měly být překryty.",
    "harvestables.field.allowCondReq": "Žádat server pouze o nové soubory (přírůstkové)?",
    "harvestables.field.allowCondReq.help": "Před pokusem o harvest se zeptejte serveru, zda jsou soubory upraveny, spoléhá se na správné zacházení s časovým razítkem na straně serveru. Obvykle je bezpečné mít toto povoleno, protože servery dychtí po aktualizaci data modifikace, a to i v případech, kdy se samotné soubory nemění. Povolení tohoto nastavení může výrazně zkrátit dobu harvestu.",
    "harvestables.field.initialFromDate": "Počáteční datum (pokud je přírůstkové)",
    "harvestables.field.initialFromDate.help": "Umožňuje zadat počáteční datum od harvestu, pokud je zaškrtnuta možnost <strong>Dotazovat se serveru pouze na nové soubory</strong>. Po vyplnění budou harvestovány pouze soubory novější než zadané datum. V případě katalogu FOLIO nastavení navíc určuje, že se mají načítat pouze příchozí záznamy, které byly aktualizovány k tomuto datu nebo po něm. Aby se toto nastavení projevilo, musí navíc příchozí záznamy v elementu \"zpracování\" uvádět \"lastUpdated\" a ve formátu RRRR-MM-DD &lt;processing&gt; &lt;lastUpdated&gt;1970-01-01&lt;/lastUpdated&gt; &lt;/processing&gt; Ve výchozím nastavení by logika filtrovala podle data ukončení posledního harvestu, takže nastavení \"Počáteční od data\" ruší výchozí chování. Platí tedy následující pravidla: <li>Pokud je zaškrtnuto 'Přepsat data', načtou se všechny záznamy.</li> V opačném případě: <li>Pokud je u příchozích záznamů uvedeno datum \"lastUpdated\" a je nastaveno \"Initial from date\", načtou se pouze záznamy aktualizované k tomuto datu nebo po něm (to platí bez ohledu na to, zda je zaškrtnuto \"Požádat server pouze o nové soubory (přírůstkové)\" nebo ne)</li> <li>Pokud je u příchozích záznamů uvedeno datum \"lastUpdated\" a NENÍ nastaveno \"Initial from date\", načtou se pouze záznamy aktualizované k datu posledního harvestu nebo po něm</li>, ale <li>načtou se všechny záznamy bez data \"lastUpdated</li>\".",
    "harvestables.field.splitAt": "Rozdělit XML do hloubky (nula/prázdné znemožní rozdělení)",
    "harvestables.field.splitAt.help": "Pro data XML. Toto by mělo být obvykle nastaveno na 1 pro XML feedy,  pokud chceme sklízet elementy záznamu v datech strukturovaných jako:   &lt;kořen&gt; &nbsp;&lt;záznam/&gt; &nbsp;&lt;záznam/&gt; &lt;/kořen&gt;",
    "harvestables.field.splitSize": "Rozdělit soubory podle počtu záznamů (nula/prázdné znemožní rozdělení)",
    "harvestables.field.splitSize.help": "Harvestor se snaží implikovat analýzu streamování, kde je to možné, ale mnoho transformací XSL to nepodporuje. Pokus o transformaci milionů záznamů bude příliš náročný na paměť, takže rozdělení zdroje na kusy po 1000 záznamech se zdá být rozumnou možností. Do tohoto pole zadejte počet záznamů, které má každý blok obsahovat.",
    "harvestables.field.expectedSchema": "Přepsání typu mime (např.: aplikace/marc; charset=MARC-8)",
    "harvestables.field.expectedSchema.help": "Harvestor zjistí typ (XML vs. binární MARC) z typu MIME a přípony souboru. Umí si poradit i s komprimovanými archivy (zip, tar, gzip), v některých výjimečných případech může být nutné zadat typ obsahu ručně (např. pokud chybí nebo je chybný), formát je:   MIME-type [; volitelné kódování znaků].",
    "harvestables.field.outputSchema": "Transformační formát MARC XML (application/marc nebo application/tmarc)",
    "harvestables.field.outputSchema.help": "Toto pole vyjadřuje výstupní formát binárního čtení MARC, který bude také vstupním formátem transformačního kanálu. Pokud transformační kanál očekává MARC21 XML, mělo by být nastaveno na Application/marc. Pokud transformační kanál očekává Turbo MARC XML, mělo by být nastaveno na Application/tmarc.",
    "harvestables.field.recurse": "Rozmnožit do podsložek?",
    "harvestables.field.recurse.help": "Po nastavení bude harvestor procházet celý adresářový strom a vyhledávat soubory, které lze sklízet. Toto nastavení by mělo být povoleno opatrně.",
    "harvestables.field.includeFilePattern": "Zahrnout soubory (regulární výraz)",
    "harvestables.field.includeFilePattern.help": "Toto nastavení lze použít k filtrování souborů, které se mají harvestovat.  Filtr se vztahuje na soubory v adresářích FTP i v archivech (ZIP/tar).  Je-li nastaven na regulární výraz, harvestor harvestuje pouze soubory s názvy odpovídajícími regulárnímu výrazu (pokud není název souboru zároveň vyloučen vzorem vyloučení).   Příklad: . <pre>*\\.xml|.*\\.marc</pre> Zahrne pouze soubory .xml a .marc.    Všimněte si, že tečky v názvech souborů musí být escapovány.    Všimněte si, že soubory ZIP a tar (.zip,.gz,.tar) se načtou, i když nejsou uvedeny ve vzoru include. Pro vynucení vyloučení souborů ZIP nebo tar by musely být uvedeny ve vzoru pro vyloučení (viz text nápovědy).",
    "harvestables.field.excludeFilePattern": "Vyloučení souborů (regulární výraz)",
    "harvestables.field.excludeFilePattern.help": "Toto nastavení lze použít k filtrování souborů, které se mají harvestovat. Filtr se vztahuje na soubory v adresářích FTP i na položky v archivech (ZIP/tar).  Je-li nastaven na regulární výraz, harvestor přeskočí všechny soubory s názvem odpovídajícím tomuto výrazu. Příklad: <pre>readme\\.txt|README|.*\\.jpg|.*\\.gif</pre> Vyloučí soubory s názvy readme.txt, README a také soubory .jpg a .gif z adresářů FTP nebo archivů ZIP/tar.",
    "harvestables.field.passiveMode": "Použít pasivní režim pro převody FTP?",
    "harvestables.field.passiveMode.help": "Pokud je nastaven pasivní režim, použije se pro připojení FTP místo aktivního režimu. Pokud harvestor běží v omezeném firewallu, který blokuje připojení FTP v aktivním režimu, může povolení tohoto nastavení pomoci. Může však být nutné sladit tento režim s tím, co očekává server FTP.",
    "harvestables.field.csvConfiguration": "Konfigurace analyzátoru CSV",
    "harvestables.field.csvConfiguration.help": "Harvestor bude zjišťovat (buď podle typu MIME, nebo podle přípony souboru) a pokusí se analyzovat soubory CSV (hodnoty oddělené čárkami) do reprezentace XML pro další zpracování. Reprezentace XML každého datového řádku vypadá následovně: <pre>&lt;řada&gt;&lt;název pole=&quot;název nebo číslo sloupce&quot;&gt;hodnota pole&lt;/pole&gt;...&lt;/řada&gt;</pre>  Pokud není možnost rozdělení v hloubce nastavena na > 0, budou všechny řádky analyzovány do jednoho dokumentu XML a zabaleny do další &lt;řady&gt; kořenového prvku. U velkých souborů CSV může být vhodné nastavit rozdělení na hloubku na 1. Konfigurace analyzátoru je vyjádřena v seznamu klíčů a hodnot oddělených středníkem, například takto: klíč1=hodnota1; klíč2=hodnota2. Seznam podporovaných možností je následující: <ul> <li> charset: default \"iso-8859-1\", určuje kódování znaků souborů</li> <li> delimiter: default \",\" for CSV and \"\\t\" for TSV, určuje oddělovač polí použitý v souborech</li> <li> containsHeader: výchozí \"ano\", určuje, zda první řádek v souborech obsahuje řádek záhlaví</li> <li> headerLine: žádné výchozí, umožňuje přepsat nebo zadat záhlaví, formát je seznam oddělený čárkami, např. headers=\"název, autor, popis\"</li></ul>",
    "harvestables.field.type.connector": "Specifické informace o konektoru",
    "harvestables.field.connectorEngineUrlSetting.label": "Modul CF",
    "harvestables.field.connectorEngineUrlSetting.label.help": "Vyberte titul Connector Engine, který bude použit k provedení úlohy harvestu konektoru. Výchozí modul je hostitelem Index Data, ale může být také nainstalován lokálně na webu zákazníka. Dodatečné Connector Engines lze zadat na kartě Nastavení.",
    "harvestables.field.engineParameters": "Parametry modulu (volitelné)",
    "harvestables.field.engineParameters.help": "Dodatečné nebo vlastní hodnoty parametrů relace Connector Engine používané touto úlohou. Více informací najdete v manuálu na stránce CFWS.",
    "harvestables.field.connectorRepoUrlSetting.label": "Úložiště CF",
    "harvestables.field.connectorRepoUrlSetting.label.help": "Vyberte úložiště konektorů, kde jsou konektory hostovány a spravovány. Úložiště konektoru obvykle poskytuje Index Data a může vyžadovat přihlašovací účet. Přihlašovací údaje účtu jsou poskytovány přímo v nastavení adresy URL úložiště konektorů, ke kterému se dostanete z karty Nastavení, a měly by mít tvar: <pre>http(s)://&lt;repouser&gt;:&lt;repopass&gt;@url.to.the.repository</pre>.",
    "harvestables.field.connector": "Konektor (typ pro návrh)",
    "harvestables.field.connector.help": "Zde zadejte název harvestového konektoru specifického pro harvestovaný zdroj. Toto pole poskytuje návrhy vyhledáním úložiště, takže je vyžadováno pouze několik počátečních znaků nebo část názvu.",
    "harvestables.field.overwrite-connector.help": "Zaškrtnutím této možnosti smažete všechna dříve získaná data před zahájením dalšího rozvrženého (nebo ručně spouštěného) běhu.",
    "harvestables.field.connuser": "Uživatelské jméno",
    "harvestables.field.connuser.help": "Uživatelské jméno je vyžadováno pro přístup ke zdroji harvestu, který vyžaduje ověření.",
    "harvestables.field.password": "Heslo",
    "harvestables.field.password.help": "Heslo vyžadované pro přístup ke sklízenému zdroji, který vyžaduje ověření.",
    "harvestables.field.proxy": "Adresa proxy serveru",
    "harvestables.field.proxy.help": "Adresa proxy serveru, který by měl použít modul harvestu, např. pro případy, kdy je zdroj ověřen pomocí IP.",
    "harvestables.field.initData": "Úvodní data",
    "harvestables.field.initData.help": "Rozšířené nastavení pro zadání dodatečných inicializačních parametrů harvestorového konektoru. Jakékoli uživatelské jméno/heslo/zástupce zadané ve výše uvedených vstupech budou mít přednost před nastavením zadaným v tomto poli. Tato nastavení musí být zadána ve formátu JSON.",
    "harvestables.field.startToken": "Startovací token (přírůstkový harvest)",
    "harvestables.field.startToken.help": "Využití startovacího tokenu pro přírůstkové sklízení je specifické pro konektor a závisí na schopnosti konektoru. Toto nastavení musí být poskytnuto ve formátu JSON.",
    "harvestables.field.sleep": "Prodleva mezi žádankami (milisekundy)",
    "harvestables.field.sleep.help": "Prodleva mezi požadavky z harvestoru do connector engine. Použijte, když je zdroj citlivý na vysoké zatížení.",
    "harvestables.field.failedRetryCount": "Počet opakování neúspěšných žádanek",
    "harvestables.field.failedRetryCount.help": "Upřesnit, kolikrát má harvestor opakovat neúspěšné žádosti na harvest, 0 opakování zcela zakáže.",
    "harvestables.field.type.status": "Obecné informace",
    "harvestables.field.usageTags": "Filtr: seznam štítků využití",
    "harvestables.field.usageTags.help": "Slouží k filtrování výstupu o stavu podle skupin uživatelů u zákazníků označených k úloze harvestu (\"Používáno\").",
    "harvestables.field.adminTags": "Filtr: seznam štítků správce",
    "harvestables.field.adminTags.help": "Slouží k filtrování hlášení o stavu podle tvůrce nebo správce harvestu, jak je označeno k úloze harvestu (\"Spravováno\")",
    "harvestables.field.statusJobEnabled": "Stavová úloha povolena",
    "harvestables.field.customMailAddresses": "Vlastní e-mailové adresy (vícenásobné oddělené čárkou)",
    "harvestables.heading.status": "Informace o stavu",
    "harvestables.field.currentStatus": "Aktuální stav:",
    "harvestables.field.initiallyHarvested": "Počáteční harvest",
    "harvestables.field.lastHarvestStarted": "Začátek posledního harvestu",
    "harvestables.field.lastHarvestFinished": "Dokončen poslední harvest",
    "harvestables.field.lastUpdated": "Poslední aktualizace",
    "harvestables.field.message": "Zpráva z minulého harvestu:",
    "harvestables.field.failedRecordsLogging.NO_STORE": "Neukládat neúspěšné záznamy",
    "harvestables.field.failedRecordsLogging.CLEAN_DIRECTORY": "Uložení nejprve vyčistí adresář",
    "harvestables.field.failedRecordsLogging.CREATE_OVERWRITE": "Uložení přepíše existující soubory",
    "harvestables.field.failedRecordsLogging.ADD_ALL": "Uložení přidá číslované verze pro existující soubory",
    "SENTINEL": "HLÍDKA",
    "harvestables.field.jobClass": "Třída úlohy",
    "harvestables.field.jobClass.oaiPmh": "OAI-PMH",
    "harvestables.field.jobClass.xmlBulk": "Hromadné XML",
    "harvestables.field.jobClass.connector": "Konektor harvestoru",
    "harvestables.field.jobClass.status": "Výstup o stavu",
    "harvestables.column.currentStatus.SHUTDOWN": "Vypnout",
    "button.view-log": "Zobrazit log",
    "summary-table.summary": "Shrnutí",
    "summary-table.instances": "Titul",
    "summary-table.holdings": "Holdingy",
    "summary-table.items": "Jednotka",
    "summary-label.processed": "Zpracováno",
    "summary-label.loaded": "Načteno",
    "summary-label.deleted": "Smazáno(přeskočeno)",
    "summary-label.failed": "Neúspěšný",
    "failed-records.recordNumber": "Číslo záznamu",
    "failed-records.timeStamp": "Časový úsek",
    "failed-records.instanceHrid": "HRID titulu",
    "failed-records.instanceTitle": "Název titulu",
    "failed-records.errors": "Chyby",
    "harvestables.column.logFile": "Soubor logu",
    "harvestables.column.records": "Záznamy",
    "logs.countFailedRecords": "{count, number} {count, plural, one {neúspěšný záznam} other {neúspěšné záznamy}}",
    "stats.instances": "Tituly",
    "stats.holdings": "Holdingy",
    "stats.items": "Jednotky",
    "nav.jobs": "Úlohy",
    "nav.jobs-for": "Úlohy pro {name}",
    "button.old-jobs": "Staré úlohy",
    "logs.plainTextLog.running": "Aktuální textový log pro spuštěnou úlohu",
    "logs.plainTextLog.previous": "Textový log poslední úlohy",
    "logs.plainTextLog.refresh": "Obnovit",
    "settings.storage": "Modul úložiště",
    "settings.pipeline": "Transformační kanály",
    "settings.step": "Transformační kroky",
    "permission.all": "Správce harvestoru: Všechna oprávnění",
    "filter.date.started": "Datum zahájení",
    "filter.date.started.from": "Od",
    "filter.date.started.to": "Do",
    "filter.date.finished": "Datum dokončení",
    "filter.date.finished.from": "Od",
    "filter.date.finished.to": "Do",
    "error.invalidSort.label": "Nesprávné kritérium seřazení",
    "error.invalidSort.content": "Z důvodu implementačních omezení není možné seřadit podle sloupce <code>{name}</code>.",
    "jobs.index.name": "Harvestovatelné jméno",
    "jobs.index.id": "ID",
    "jobs.index.harvestableId": "Harvestovatelné ID",
    "jobs.index.message": "Zpráva",
    "jobs.index.all": "(Všechny)",
    "jobs.column.name": "Harvestovatelné jméno",
    "jobs.column.status": "Stav",
    "jobs.column.amountHarvested": "Záznamy",
    "jobs.column.seconds": "Sekundy",
    "jobs.column.started": "Zahájeno",
    "jobs.column.finished": "Dokončeno",
    "jobs.column.type": "Třída úlohy",
    "jobs.column.message": "Zpráva (zpracována/načtena/smazána(přeskočena)/neúspěšná)",
    "nav.records": "Neúspěšné záznamy",
    "records.index.recordNumber": "Číslo záznamu",
    "records.index.instanceHrid": "HRID titulu",
    "records.index.instanceTitle": "Název titulu",
    "records.index.errors": "Chyby",
    "records.index.timeStamp": "Časový úsek",
    "records.index.harvestableName": "Harvestovatelné jméno",
    "records.index.all": "(Všechny)",
    "filter.date.timeStamp": "Časový úsek",
    "filter.date.timeStamp.from": "Od",
    "filter.date.timeStamp.to": "Do",
    "failed-records.harvestableName": "Harvestovatelné jméno",
    "button.view-log.current": "Aktuální log",
    "button.view-log.last": "Poslední log",
    "harvestables.column.oldJobs": "Staré úlohy",
    "selectValue": "Zvolit hodnotu",
    "fillIn": "Chcete-li pokračovat, vyplňte prosím toto",
    "selectToContinue": "Vyberte prosím pro pokračování",
    "filter.numeric.records": "Záznamy",
    "filter.numeric.records.from": "Alespoň",
    "filter.numeric.records.to": "Ne více než",
    "settings.storage.heading": "Spravovat moduly úložišť",
    "settings.pipeline.heading": "Spravovat transformační kanály",
    "settings.step.heading": "Spravovat kroky transformace",
    "storage.field.name": "Jméno",
    "storage.field.description": "Popis",
    "storage.field.enabled": "Povoleno",
    "storage.field.url": "URL",
    "storage.field.json": "Konfigurace JSON",
    "storage.field.type": "Typ úložiště:",
    "invalidJSON": "Neplatný JSON: {error}",
    "op.run.error": "Nepodařilo se spustit úlohu <b>{name}</b>: {error}",
    "op.stop.error": "Nepodařilo se zastavit úlohu <b>{name}</b>: {error}",
    "logs.plainTextLog.download": "Stáhnout",
    "pipeline.field.name": "Jméno",
    "pipeline.field.description": "Popis",
    "pipeline.field.enabled": "Povoleno",
    "pipeline.field.parallel": "Paralelní",
    "pipeline.field.stepAssociations": "Transformační kroky",
    "pipeline.steps.position": "#",
    "pipeline.steps.name": "Jméno",
    "pipeline.steps.in": "Včas",
    "pipeline.steps.out": "Pozdě",
    "pipeline.steps.actions": "Akce",
    "step.field.name": "Jméno",
    "step.field.description": "Popis",
    "step.field.enabled": "Povoleno (nevyužito)",
    "step.field.type": "Typ",
    "step.field.inputFormat": "Vstupní formát",
    "step.field.outputFormat": "Výstupní formát",
    "step.field.script": "Skript",
    "step.field.testData": "Testovací data",
    "step.field.testOutput": "Testovací výstup",
    "step.field.customClass": "Vlastní třída",
    "harvestables.field.statusJobEnabled.help": "Prázdné",
    "harvestables.field.customMailAddresses.help": "Prázdné",
    "set-to-xml2json": "Vybrat převod XML na JSON",
    "export-csv": "Export CSV",
    "invalidXML": "Neplatné XML: {error}",
    "invalidXSLT": "Platné XML, ale ne šablona stylů XSLT",
    "validXSLT": "Platná šablona stylů XSLT",
    "reports": "Výstupy",
    "transform": "Transformovat",
    "nav.mike": "Mike",
    "permission.settings.view": "Harvester admin (Settings): View storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit": "Harvester admin (Settings): View, edit storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit-create": "Harvester admin (Settings): View, edit, create storage engines, transformation pipelines and transformation steps",
    "permission.settings.view-edit-create-delete": "Harvester admin (Settings): View, edit, create, delete storage engines, transformation pipelines and transformation steps",
    "permission.harvestables.view": "Harvester admin: View harvestables",
    "permission.harvestables.view-edit": "Harvester admin: View, edit harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create": "Harvester admin: View, edit, create harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create-delete": "Harvester admin: View, edit, create, delete harvestables, start/stop jobs",
    "permission.jobs-and-failed-records.view": "Harvester admin: View jobs and failed records"
}