{
    "meta.title": "Harvester Admin",
    "no-value": "-",
    "error": "Fehler ist aufgetreten",
    "resultCount": "{count, number} {count, plural, one {Datensatz gefunden} other {Datensätze gefunden}}",
    "add": "Hinzufügen",
    "actions.new": "Neuer Datensatz",
    "actions.new.harvestable.oaiPmh": "OAI-PMH Harvestable",
    "actions.new.harvestable.xmlBulk": "XML Bulk Harvestable",
    "actions.new.harvestable.connector": "Connector Harvestable",
    "actions.new.harvestable.status": "Statusreport Harvestable",
    "nav.harvestables": "Harvest-Jobs",
    "button.edit": "Bearbeiten",
    "button.delete": "Löschen",
    "button.start-job": "Job starten",
    "button.stop-job": "Job stoppen",
    "button.confirm": "Bestätigen",
    "op.delete.confirm": "Datensatz wirklich löschen?",
    "op.delete.completed": "Datensatz <b>{name}</b> gelöscht",
    "op.run.completed": "Job <b>{name}</b> gestartet",
    "op.stop.completed": "Job <b>{name}</b> gestoppt",
    "harvestables.column.name": "Name",
    "harvestables.column.currentStatus": "Status",
    "harvestables.column.lastHarvestFinished": "Letzter Harvest abgeschlossen",
    "harvestables.column.enabled": "Aktiviert?",
    "harvestables.column.jobClass": "Jobklasse",
    "harvestables.column.id": "ID",
    "harvestables.column.message": "Nachricht (verarbeitet/geladen/gelöscht(geskipped)/fehlgeschlagen)",
    "harvestables.column.enabled.true": "Ja",
    "harvestables.column.enabled.false": "Nein",
    "harvestables.column.jobClass.OaiPmhResource": "OAI-PMH",
    "harvestables.column.jobClass.XmlBulkResource": "XML-Bulk",
    "harvestables.column.jobClass.HarvestConnectorResource": "Harvest-Konnector",
    "harvestables.column.jobClass.StatusResource": "Statusbericht",
    "harvestables.column.currentStatus.NEW": "New",
    "harvestables.column.currentStatus.OK": "OK",
    "harvestables.column.currentStatus.WARN": "Warning",
    "harvestables.column.currentStatus.ERROR": "Error",
    "harvestables.column.currentStatus.RUNNING": "Running",
    "harvestables.column.currentStatus.FINISHED": "Finished",
    "harvestables.column.currentStatus.KILLED": "Killed",
    "harvestables.index.name": "Name",
    "harvestables.index.id": "ID",
    "harvestables.index.message": "Nachricht",
    "searchInputLabel": "XXX searchInputLabel",
    "accordion.devinfo": "Entwicklerinformationen",
    "harvestables.heading.general": "Allgemeine Informationen",
    "harvestables.field.id": "Id",
    "harvestables.field.id.help": "Automatisch zugewiesene Kennung für den Job",
    "harvestables.field.name": "Name",
    "harvestables.field.name.help": "Vorzugsweise ein eindeutiger Name, mit dem die Nutzer diese Harvester-Ressource identifizieren können. In einigen Fällen kann der Name nach Ausfüllen des protokollspezifischen Abschnitts der Konfiguration vorgeschlagen werden (z. B. Index Data Connectors, OAI-PMH).",
    "harvestables.field.serviceProvider": "Anbieter",
    "harvestables.field.serviceProvider.help": "Freitextfeld, das vom Support zur Erfassung von administrativen Informationen verwendet wird. Wird vom Harvester nicht verwendet.",
    "harvestables.field.usedBy": "Verwendet von",
    "harvestables.field.usedBy.help": "Freitextfeld für die Kennzeichnung eines Jobs mit dem beabsichtigten Zielpublikum, z. B. einer Benutzergruppe oder einem Kunden der Ressource. Mehrere Benutzer-/Kunden-Tags können durch Kommas getrennt werden. Die Tags können zum Filtern von Statusberichten nach Nutzern/Kunden verwendet werden.",
    "harvestables.field.managedBy": "Verwaltet von",
    "harvestables.field.managedBy.help": "Freitextfeld zur Kennzeichnung eines Auftrags mit dem Anbieter oder Verwalter der Ressource. Mehrere Tags können durch Kommata getrennt werden. Die Tags können von den Job-Administratoren zum Filtern von Statusberichten verwendet werden.",
    "harvestables.field.openAccess": "Open-Access-Ressource?",
    "harvestables.field.description": "Beschreibung des Inhalts",
    "harvestables.field.description.help": "Freitextfeld, das vom Personal zur Erfassung von Verwaltungsinformationen verwendet wird. Wird vom Harvester nicht verwendet.",
    "harvestables.field.technicalNotes": "Technische Bemerkungen",
    "harvestables.field.technicalNotes.help": "Freitextfeld, das vom Support zur Erfassung von administrativen Informationen verwendet wird. Wird vom Harvester nicht verwendet.",
    "harvestables.field.contactNotes": "Kontaktinformationen",
    "harvestables.field.contactNotes.help": "Freitextfeld, das vom Personal zur Erfassung von Verwaltungsinformationen verwendet wird. Wird vom Harvester nicht verwendet.",
    "harvestables.field.enabled": "Harvest-Job aktiviert?",
    "harvestables.field.enabled.help": "Diese Box aktivieren, um den Harvestjob entsprechend der unter \"Harvest-Zeitplan\" ausgewählten Zeit/Intervall auszuführen. Wenn diese Box nicht ausgewählt ist, wird der Job inaktiv.",
    "harvestables.field.scheduleString": "Harvest-Zeitplan",
    "harvestables.field.scheduleString.help": "Diese Felder verwenden, um eine wiederkehrende Zeit/ein Intervall festzulegen, in dem der Harvestjob ausgeführt werden soll. Für wöchentliche Läufe kann z. B. eine Wochentag angegeben werden, an dem das Harvesting ausgeführt werden soll.",
    "harvestables.field.scheduleString.harvest": "Harvest",
    "harvestables.field.scheduleString.day": "(Tag) von",
    "harvestables.field.scheduleString.month": "(Monat), wenn es",
    "harvestables.field.scheduleString.weekday": "(Wochentag)",
    "harvestables.field.scheduleString.time": "Harvestingzeit",
    "harvestables.field.scheduleString.hour": "(Stunde im 24-Format)",
    "harvestables.field.scheduleString.minute": "(Min)",
    "harvestables.field.transformationPipeline": "Transformations-Pipeline",
    "harvestables.field.transformationPipeline.help": "Die Transformation auswählen, die erforderlich ist, um das vom Feed gelieferte Eingabeformat an das vom Harvester für die Datenspeicherung verwendete interne Format anzupassen. Weitere Einzelheiten dazu sind im Abschnitt Transformations-Pipelines des Handbuchs verfügbar.",
    "harvestables.field.laxParsing": "Laxes Parsing verwenden (wenn möglich)",
    "harvestables.field.laxParsing.help": "Wenn aktiviert, versucht der Harvester, fehlerhaftes XML zu analysieren (fehlende schließende Tags, Entities).",
    "harvestables.field.encoding": "Kodierung erzwingen (ISO-8859-1, UTF-8, ...)",
    "harvestables.field.encoding.help": "Ein Feed kann ungültig kodierte Antworten zurückgeben, z. B. einen XML-Header mit der Kodierung UTF-8, aber tatsächlich ISO-8859-1 in den Daten. Wird dieses Feld belegt, wird der Harvester gezwungen, die darin angegebene Kodierung zu verwenden.",
    "harvestables.field.storage.name": "Storage",
    "harvestables.field.storage.name.help": "Den Speichertyp und den Speicherort für die gesammelten Daten auswählen. Der Harvester verfügt über eine Speicherabstraktionsschicht, die es ihm ermöglicht, mit mehreren potenziellen Datenspeichersystemen zu arbeiten, aber derzeit wird nur Solr/Lucene unterstützt. Nach Auswahl des Speichers können die indizierten Datensätze durch Anklicken des Feldes Gespeicherte Datensätze: Zum Anzeigen anklicken angezeigt werden.",
    "harvestables.field.storageBatchLimit": "Storage-Batch-Limit",
    "harvestables.field.cacheEnabled": "Auf Festplatte cachen?",
    "harvestables.field.cacheEnabled.help": "Wenn diese Option aktiviert ist, werden die Harvestdaten im Cache des Dateisystems gespeichert und der Auftrag kann von diesem Cache aus neu gestartet werden, ohne zum Server zurückkehren zu müssen.",
    "harvestables.field.storeOriginal": "Originaldatensatzinhalt speichern?",
    "harvestables.field.recordLimit": "Anzahl der Datensätze begrenzen auf",
    "harvestables.field.recordLimit.help": "Begrenzung des Harvestlaufs auf eine bestimmte Anzahl von Datensätzen: nützlich zum Testen von Jobeinstellungen und Transformationspipelines.",
    "harvestables.field.timeout": "Verbindungs-/Lese-Timeout (Sekunden)",
    "harvestables.field.timeout.help": "Gibt einen von den Standardwerten abweichenden Timeout-Wert für das Abrufen und Lesen von der Netzwerkverbindung (Socket) an. Werte unter 1 Minute werden nicht empfohlen.",
    "harvestables.field.logLevel": "Log-Level",
    "harvestables.field.logLevel.help": "Die Protokollierungsstufe für den Job angeben, wobei DEBUG die ausführlichste ist. INFO ist in den meisten Fällen die empfohlene Protokollierungsstufe.",
    "harvestables.field.failedRecordsLogging": "Speicherung fehlgeschlagener Datensätze",
    "harvestables.field.failedRecordsLogging.help": "Legt fest, ob fehlgeschlagene Datensätze als XML-Dateien in einem bestimmten Protokollverzeichnis gespeichert werden sollen oder nicht. Legt außerdem die Aufbewahrungsrichtlinie für das Verzeichnis fest, d. h. ob Dateien, die in früheren Läufen gespeichert wurden, aufbewahrt werden sollen und, falls ja, ob eine vorhandene Datei überschrieben werden soll, wenn derselbe Datensatz erneut fehlschlägt, oder ob dem neuen Dateinamen eine laufende Nummer hinzugefügt werden soll, damit er nicht überschrieben wird.",
    "harvestables.field.maxSavedFailedRecordsPerRun": "Maximale Anzahl von fehlgeschlagenen Datensätzen, die beim nächsten Lauf gespeichert werden",
    "harvestables.field.maxSavedFailedRecordsPerRun.help": "Legt eine maximale Anzahl von Dateien fest, die pro Lauf im Verzeichnis für fehlgeschlagene Datensätze gespeichert werden. Das Auftragsprotokoll zeigt an, wenn das Limit erreicht ist.",
    "harvestables.field.maxSavedFailedRecordsTotal": "Maximale Anzahl zu speichernder fehlerhafter Datensätze insgesamt",
    "harvestables.field.maxSavedFailedRecordsTotal.help": "Legt eine maximale Anzahl von Dateien fest, die zu einem bestimmten Zeitpunkt im Verzeichnis für fehlgeschlagene Datensätze gespeichert werden sollen - als Summe der zuvor gespeicherten Datensätze (die vor diesem Lauf nicht bereinigt wurden) plus aller neuen Datensätze, die während des Laufs hinzugefügt wurden. Im Auftragsprotokoll wird vermerkt, wann das Limit erreicht ist.",
    "harvestables.field.mailAddress": "E-Mail-Adresse(n) für die Benachrichtigung (mit Komma getrennt)",
    "harvestables.field.mailAddresses": "E-Mail-Adressen für Benachrichtigungen",
    "harvestables.field.mailAddresses.help": "Liste der E-Mail-Adressen, die bei Job-Ende  benachrichtigt werden sollen.",
    "harvestables.field.mailLevel": "Benachrichtigung senden, wenn Schweregrad mindestens",
    "harvestables.field.mailLevel.help": "Status des Auftragsabschlusses mit dem geringsten Schweregrad angeben, der eine E-Mail-Benachrichtigung auslöst.",
    "harvestables.field.constantFields": "Liste der konstanten Felder",
    "harvestables.field.constantFields.help": "Eine Liste von NAME=VALUE-Paaren. Bei einem Harvestable, für das dieses Feld festgelegt ist, wird für jeden geharvesteten Datensatz jedes NAME-Feld auf den entsprechenden VALUE gesetzt.",
    "harvestables.field.json": "Zusätzliche Konfiguration: (JSON)",
    "harvestables.field.json.help": "Geben Sie eine zusätzliche erweiterte Harvester-Konfiguration im JSON-Format an.",
    "harvestables.field.type.oaiPmh": "OAI-PMH-spezifische Informationen",
    "harvestables.field.url": "URL des OAI-Repository",
    "harvestables.field.url.help": "Einen (HTTP-basierten) Link zu der Ressource angegeben, die geharvestet werden soll. Den durch OAI-Set-Name definierten Basislink einschließen: (siehe unten). Einige Ressourcen haben mehrere Sets innerhalb des Repositorys. Ist in der URL kein spezifisches Set angegeben, wird das gesamte Repository abgefragt.",
    "harvestables.field.oaiSetName": "OAI-Set-Name (Tippen für Vorschläge)",
    "harvestables.field.oaiSetName.help": "Eine optionale Einstellung, ein OAI-PMH setSpec-Wert, der die Kriterien für das selektive Harvesting festlegt.",
    "harvestables.field.metadataPrefix": "Metadaten-Präfix",
    "harvestables.field.metadataPrefix.help": "Eine Zeichenfolge, die das Metadatenformat in OAI-PMH-Anfragen an ein bestimmtes Repository angibt. Es ist wichtig, das richtige Format zu wählen, da sonst keine Daten aus dem Repository geharvestet werden können. Es muss sichergestellt werden, dass eine Transformationspipeline ausgewählt wird, die dem im Repository verwendeten Metadatenformat entspricht, da die Datensätze sonst vom Harvester nicht verstanden werden. Repositorien verwenden im Allgemeinen eines der folgenden Präfixe (oder eingebettete Datenformate): Dublin Core (OAI-DC) oder MARC XML (MARC12/USMARC). Andere, weniger gebräuchliche MetadataPrefix-Werte sind PMC (PubMed Central-Volltextsätze), PMC (PubMed Central-Metadatensätze) und PZ2 (pazpar2).",
    "harvestables.field.dateFormat": "Datumsformat",
    "harvestables.field.useLongDateFormat": "Langes Datumsformat verwenden",
    "harvestables.field.useLongDateFormat.help": "Checkbox zur Angabe, ob ein langes Datumsformat verwendet werden soll, wenn Datensätze von der OAI-PMH-Ressource angefordert werden. Dies wird nicht sehr häufig verwendet, ist aber für einige Ressourcen erforderlich.",
    "harvestables.field.fromDate": "Havesten von",
    "harvestables.field.fromDate.help": "Wenn dieses Feld leer ist und kein Resumption-Token gesetzt ist, holt der Harvester den gesamten Datensatz von der Ressource. Wenn dieses Feld einen Wert enthält, setzt der Harvester nach Abschluss des Auftrags den Wert dieses Feldes auf den Tag vor dem aktuellen Laufdatum zurück, so dass bei nachfolgenden Läufen nur neue Datensätze erfasst werden.",
    "harvestables.field.untilDate": "Havesten bis",
    "harvestables.field.untilDate.help": "Obere Datumsgrenze für selektives Harvesting. Bei aufeinanderfolgenden Läufen löscht der Harvester dieses Feld, wodurch das Datumsintervall unbefristet ist.",
    "harvestables.field.resumptionToken": "Resumption Token (überschreibt Datum)",
    "harvestables.field.resumptionToken.help": "Das OAI-PMH-Protokoll unterstützt die Aufteilung größerer Datensätze in kleinere Teile. Bei der Lieferung eines Datensatzes gibt OAI-PMH ein Token zurück, das bei der nächsten Anfrage verwendet werden sollte, um den nächsten Datensatz zu erhalten. Wird ein OAI-PMH-Auftrag vor der Fertigstellung angehalten, wird das Resumption-Token in dieses Feld eingetragen. Manchmal ist es möglich, den Auftrag zu einem späteren Zeitpunkt von diesem Wiederaufnahmepunkt aus erneut zu starten, was jedoch nicht immer unterstützt wird.",
    "harvestables.field.clearRtOnError": "Wiederaufnahme-Token bei Verbindungsfehlern löschen",
    "harvestables.field.clearRtOnError.help": "Das Resumption-Token für Harvests löschen, die in einem Fehlerzustand abgeschlossen werden. Dies ist nützlich, wenn ein Serverfehler auftritt und das letzte Resumption-Token nicht mehr gültig ist.",
    "harvestables.field.keepPartial": "Partiellen harvest behalten",
    "harvestables.field.keepPartial.help": "Wenn diese Option aktiviert ist, werden die während eines fehlgeschlagenen Harvests geharvesteten Datensätze gespeichert.",
    "harvestables.field.retryCount": "Anzahl der Wiederholungsanfragen",
    "harvestables.field.retryCount.help": "Angeben, wie oft der Harvester fehlgeschlagene Harvestanfragen wiederholen soll. 0 deaktiviert den erneuten Versuch vollständig.",
    "harvestables.field.retryWait": "Verzögerung vor Wiederholungsversuch (Sekunden)",
    "harvestables.field.retryWait.help": "Verzögerung für die Wiederholung von fehlgeschlagenen Anfragen. Nur ändern, wenn die Ressource mit den Standardwerten nicht funktioniert.",
    "harvestables.field.type.xmlBulk": "XML-Massenbearbeitungsspezifische Informationen",
    "harvestables.field.urls": "URLs",
    "harvestables.field.urls.help": "Eine oder mehrere durch Leerzeichen getrennte URL (HTTP oder FTP) für XML- oder MARC-Binärdaten. Sprung- oder Indexseiten (HTML-Seiten mit URLs) werden unterstützt, ebenso FTP-Verzeichnisse. Für FTP kann das Harvesting von rekursiven Verzeichnissen unten aktiviert werden.",
    "harvestables.field.allowErrors": "Bei Fehlern fortfahren?",
    "harvestables.field.allowErrors.help": "Diese Option aktivieren, um mit dem Harvesten und Speichern von Datensätzen fortzufahren, auch wenn das Abrufen einiger der aufgelisteten Ressourcen fehlschlägt.",
    "harvestables.field.overwrite": "Daten bei jedem Lauf überschreiben (nicht inkrementell)?",
    "harvestables.field.overwrite.help": "Diese Option aktivieren, um alle zuvor gesammelten Daten zu löschen, bevor der nächste geplante (oder manuell ausgelöste) Lauf startet. Dies kann verwendet werden, wenn sich vollständige Katalog-Dumps auf dem Server befinden. Mit FOLIO-Inventory-Storage werden nicht alle zuvor erfassten Daten gelöscht, und die Aktivierung dieser Option zeigt stattdessen an, dass vorhandene Datensätze überlagert werden sollen.",
    "harvestables.field.allowCondReq": "Server nur nach neuen Dateien fragen (inkrementell)?",
    "harvestables.field.allowCondReq.help": "Fragt den Server, ob die Dateien geändert wurden, bevor eine Harvesten versucht wird, und verlässt sich auf eine korrekte Zeitstempelverarbeitung auf der Serverseite. In der Regel ist es sicher, diese Einstellung zu aktivieren, da die Server das Änderungsdatum gerne aktualisieren, auch wenn sich die Dateien selbst nicht ändern. Die Aktivierung dieser Einstellung kann die Harvestzeit erheblich verkürzen.",
    "harvestables.field.initialFromDate": "Initiales Ab-Datum (falls inkrementell)",
    "harvestables.field.initialFromDate.help": "Ermöglicht die Angabe des Anfangsdatums für das Harvesten, wenn die Option <strong>Nur neue Dateien vom Server anfordern</strong> aktiviert ist. Wenn diese Option ausgewählt wird, werden nur Dateien, die neuer als das angegebene Datum sind, geharvestet. Bei FOLIO-Inventory-Storage gibt die Einstellung zusätzlich an, dass nur eingehende Datensätze, die an oder nach diesem Datum aktualisiert wurden, geladen werden sollen. Damit dies wirksam wird, müssen die eingehenden Datensätze außerdem ein \"lastUpdated\" im Element \"processing\" und im Format JJJJ-MM-TT aufweisen <processing> <lastUpdated>1970-01-01</lastUpdated> </processing> Standardmäßig würde die Logik nach dem Enddatum des letzten Harvest filtern, so dass die Einstellung \"Anfangsdatum von\" das Standardverhalten außer Kraft setzt. Es gelten also folgende Regeln: <li>Wenn 'Daten überschreiben' angehakt ist, werden alle Datensätze geladen.</li> Andernfalls: <li>Wenn die eingehenden Datensätze ein \"lastUpdated\"-Datum enthalten und das \"Anfangsdatum von\" gesetzt ist, werden nur Datensätze geladen, die an oder nach diesem Datum aktualisiert wurden (dies gilt unabhängig davon, ob \"Nur neue Dateien vom Server anfordern (inkrementell)\" markiert ist oder nicht)</li> <li>Wenn die eingehenden Datensätze ein \"lastUpdated\"-Datum enthalten und das \"Anfangsdatum von\" NICHT gesetzt ist, werden nur Datensätze geladen, die am oder nach dem letzten Harvest aktualisiert wurden</li>.",
    "harvestables.field.splitAt": "XML ab Ebene aufteilen (Null/Leer deaktiviert die Aufteilung)",
    "harvestables.field.splitAt.help": "Für XML-Daten. Dies sollte in der Regel auf 1 für XML-Feeds gesetzt werden, wenn die Datensatzelemente in den Daten wie folgt strukturiert geharvestet werden sollen: &lt;root&gt; &lt;record/&gt; &lt;record/&gt; &lt;/root&gt;",
    "harvestables.field.splitSize": "Dateien nach Anzahl der Datensätze aufteilen (Null/Leer deaktiviert die Aufteilung)",
    "harvestables.field.splitSize.help": "Der Harvester versucht, wo immer möglich, ein Streaming-Parsing durchzuführen, aber viele XSL-Transformationen unterstützen dies nicht. Der Versuch, Millionen von Datensätzen zu transformieren, wird zu viel Speicherplatz beanspruchen, so dass die Aufteilung der Ressource in Stücke von 1000 Datensätzen eine vernünftige Option sein kann. In dieses Feld die Anzahl der Datensätze eingeben, die in jedem Block enthalten sein sollen.",
    "harvestables.field.expectedSchema": "Mime-Typ erzwingen (z. B.: application/marc; charset=MARC-8)",
    "harvestables.field.expectedSchema.help": "Der Harvester erkennt den Typ (XML vs. MARC Binary) anhand des MIME-Typs und der Dateierweiterung. Er ist auch in der Lage, mit komprimierten Archiven (zip, tar, gzip) umzugehen. In seltenen Fällen kann es erforderlich sein, den Inhaltstyp manuell anzugeben (z.B. wenn er fehlt oder falsch ist), das Format ist:   MIME-Typ [; optionale Zeichenkodierung].",
    "harvestables.field.outputSchema": "MARC-XML-Transformationsformat (application/marc oder application/tmarc)",
    "harvestables.field.outputSchema.help": "Dieses Feld gibt das Ausgabeformat der binären MARC-Einspielung an, das auch das Eingabeformat für die Transformationspipeline sein wird. Wenn für die Transformationspipeline MARC21-XML verwendet wird, sollte dies auf Application/marc gesetzt werden. Wenn für die Pipeline Turbo MARC XML verwendet wird, sollte sie auf Application/tmarc eingestellt werden.",
    "harvestables.field.recurse": "Unterordner einbeziehen?",
    "harvestables.field.recurse.help": "Wenn diese Einstellung aktiviert ist, durchläuft der Harvester den gesamten Verzeichnisbaum und sucht nach sammelbaren Dateien. Diese Einstellung sollte mit Vorsicht aktiviert werden.",
    "harvestables.field.includeFilePattern": "Dateien einschließen (regulärer Ausdruck)",
    "harvestables.field.includeFilePattern.help": "Diese Einstellung kann verwendet werden, um zu filtern, welche Dateien geharvestet werden sollen. Der Filter gilt sowohl für Dateien in FTP-Verzeichnissen als auch in Archiven (ZIP/tar). Wenn er auf einen regulären Ausdruck eingestellt ist, sammelt der Harvester nur Dateien, deren Namen mit dem regulären Ausdruck übereinstimmen (es sei denn, der Dateiname ist gleichzeitig durch ein Ausschlussmuster ausgeschlossen). Beispiel: <pre>.*\\.xml|.*\\.marc</pre> würde nur .xml- und .marc-Dateien einschließen. Punkte im Dateinamen müssen mit Escapezeichen versehen werden. ZIP- und tar-Dateien (.zip,.gz,.tar) werden auch dann geladen, wenn sie nicht im Einschlussmuster angegeben sind. Um den Ausschluss von ZIP- oder tar-Dateien zu erzwingen, müssen sie in einem exclude-Muster angegeben werden (siehe Hilfetext).",
    "harvestables.field.excludeFilePattern": "Dateien ausschließen (regulärer Ausdruck)",
    "harvestables.field.excludeFilePattern.help": "Diese Einstellung kann verwendet werden, um zu filtern, welche Dateien geharvestet werden sollen. Der Filter gilt sowohl für Dateien in FTP-Verzeichnissen als auch für Einträge in Archiven (ZIP/tar). Wenn er auf einen regulären Ausdruck eingestellt ist, überspringt der Harvester alle Dateien mit einem Dateinamen, der dem Ausdruck entspricht. Beispiel: <pre>readme\\.txt|README|.*\\.jpg|.*\\.gif</pre> Würde Dateien mit den Namen readme.txt, README sowie .jpg- und .gif-Dateien aus FTP-Verzeichnissen oder ZIP-/Tar-Archiven ausschließen.",
    "harvestables.field.passiveMode": "Passivmodus für FTP-Übertragungen verwenden?",
    "harvestables.field.passiveMode.help": "Bei dieser Einstellung wird für FTP-Verbindungen der passive statt des aktiven Modus verwendet. Wenn Harvester hinter einer Firewall läuft, die FTP-Verbindungen im aktiven Modus blockiert, kann die Aktivierung dieser Einstellung helfen. Es kann jedoch notwendig sein, diesen Modus mit dem abzustimmen, was der FTP-Server erwartet.",
    "harvestables.field.csvConfiguration": "CSV-Parser-Konfiguration",
    "harvestables.field.csvConfiguration.help": "Der Harvester erkennt (entweder anhand des MIME-Typs oder der Dateierweiterung) CSV-Dateien (kommagetrennte Werte) und versucht, sie für die weitere Verarbeitung in eine XML-Repräsentation zu parsen. Die XML-Repräsentation jeder Datenzeile sieht wie folgt aus: <pre>&lt;row&gt;&lt;field name=&quot;column name or number&quot;&gt;Feldwert&lt;/field&gt;...&lt;/row&gt;</pre> Sofern die Option split at depth nicht auf > 0 gesetzt ist, werden alle Zeilen in ein einziges XML-Dokument geparst und mit einem zusätzlichen &lt;rows&gt;-Wurzelelement umschlossen. Bei großen CSV-Dateien kann es sinnvoll sein, die Option split at depth auf 1 zu setzen. Die Konfiguration des Parsers wird in einer durch Semikolon getrennten Schlüssel/Wert-Liste ausgedrückt, etwa so: key1=value1; key2=value2. Die Liste der unterstützten Optionen lautet wie folgt: <ul> <li> charset: Standardwert \"ISO-8859-1\", gibt die Zeichenkodierung der Dateien an</li> <li> delimiter: standardmäßig \",\" für CSV und \"\\t\" für TSV, gibt das in den Dateien verwendete Feldtrennzeichen an</li> <li> containsHeader: Standardwert \"yes\", legt fest, ob die erste Zeile in den Dateien die Kopfzeile enthält</li> <li> headerLine: kein Standardwert, ermöglicht das Überschreiben oder Angeben von Kopfzeilen, Format ist eine durch Komma getrennte Liste, z. B. headers=\"title,author,description\"</li></ul>",
    "harvestables.field.type.connector": "Konnektorspezifische Informationen",
    "harvestables.field.connectorEngineUrlSetting.label": "CF-Engine",
    "harvestables.field.connectorEngineUrlSetting.label.help": "Die Konnektor-Engine-Instanz auswählen, die für die Ausführung des Konnektor-Harvesting-Jobs verwendet werden soll. Die Standard-Engine wird von Index Data gehostet, kann aber auch lokal auf dem Kundenstandort installiert werden. Zusätzliche Konnector-Engines können über die Registerkarte \"Einstellungen\" angegeben werden.",
    "harvestables.field.engineParameters": "Engine-Parameter (optional)",
    "harvestables.field.engineParameters.help": "Zusätzliche oder benutzerdefinierte Werte für Sitzungsparameter der Konnektor-Engine, die von diesem Job verwendet werden. Für weitere Informationen siehe die CFWS-Manpage.",
    "harvestables.field.connectorRepoUrlSetting.label": "CF-Repository",
    "harvestables.field.connectorRepoUrlSetting.label.help": "Das Konnektor-Repository, in dem die Konnektoren gehostet und gepflegt werden, auswählen. Normalerweise wird das Konnektor-Repository von Index Data zur Verfügung gestellt und kann ein Anmeldekonto erfordern. Die Anmeldedaten für das Konto werden direkt in der Einstellung \"Konnektor Repository URL\" auf der Registerkarte \"Einstellungen\" angegeben und sollten folgende Form haben: <pre>http(s)://&lt;repouser&gt;:&lt;repopass&gt;@url.to.the.repository</pre>.",
    "harvestables.field.connector": "Konnektor (tippen für Vorschläge)",
    "harvestables.field.connector.help": "Den Namen des Harvesting-Konnektors eingeben, der für die geharvestete Ressource spezifisch ist. Dieses Feld bietet Vorschläge, indem im Repository nachgeschlagen wird, sodass nur ein paar Anfangsbuchstaben oder ein Teil des Namens erforderlich sind.",
    "harvestables.field.overwrite-connector.help": "Aktivieren, um alle zuvor geharvesteten Daten zu löschen, bevor der nächste geplante (oder manuell ausgelöste) Lauf beginnt.",
    "harvestables.field.connuser": "Systemkennung",
    "harvestables.field.connuser.help": "Systemkennung, die für den Zugriff auf eine geharvestete Ressource, die eine Authentifizierung erfordert, erforderlich ist.",
    "harvestables.field.password": "Passwort",
    "harvestables.field.password.help": "Passwort, das für den Zugriff auf eine geharvestete Ressource, die eine Authentifizierung erfordert, erforderlich ist.",
    "harvestables.field.proxy": "Proxy-Server-Adresse",
    "harvestables.field.proxy.help": "Adresse des Proxy-Servers, der von der Harvesting-Engine verwendet werden soll, z. B. für den Fall, dass die Ressource IP-authentifiziert ist.",
    "harvestables.field.initData": "Init-Daten",
    "harvestables.field.initData.help": "Erweiterte Einstellung zur Bereitstellung zusätzlicher Initialisierungsparameter für den Harvesting-Konnector. Jede(s) Kennung/Passwort/Proxy, der in den obigen Eingaben angegeben wird, hat Vorrang vor den in diesem Feld angegebenen Einstellungen. Diese Einstellungen müssen im JSON-Format angegeben werden.",
    "harvestables.field.startToken": "Starttoken (inkrementelles harvesten)",
    "harvestables.field.startToken.help": "Die Verwendung eines Start-Tokens für das inkrementelle Harvesting ist konnektorspezifisch und hängt von den Fähigkeiten des Konnektors ab. Diese Einstellung muss im JSON-Format bereitgestellt werden.",
    "harvestables.field.sleep": "Verzögerung zwischen Anfragen (Millisekunden)",
    "harvestables.field.sleep.help": "Verzögerung zwischen den Anfragen des Harvesters an die Connector Engine. Wird verwendet, wenn die Ressource empfindlich auf hohe Zugriffszahlen reagiert.",
    "harvestables.field.failedRetryCount": "Anzahl Wiederholungsversuche bei Fehlschlag",
    "harvestables.field.failedRetryCount.help": "Angeben, wie oft der Harvester fehlgeschlagene Harvestanfragen wiederholen soll. 0 deaktiviert den erneuten Versuch vollständig.",
    "harvestables.field.type.status": "Allgemeine Informationen",
    "harvestables.field.usageTags": "Filter: Liste der Verwendungs-Tags",
    "harvestables.field.usageTags.help": "Dient zum Filtern des Statusberichts nach Personengruppen für Kunden, die dem Job zugeordnet sind (\"Verwendet von\")",
    "harvestables.field.adminTags": "Filter, kommagetrennte Liste von Admin-Tags",
    "harvestables.field.adminTags.help": "Dient zum Filtern des Statusberichts nach dem Ersteller oder Verwalter des Harvestables, entsprechend der Markierung des Harvestjobs (\"Verwaltet von\")",
    "harvestables.field.statusJobEnabled": "Statusjob aktiviert",
    "harvestables.field.customMailAddresses": "Benutzerdefinierte E-Mail-Adressen (mehrere mit Komma getrennt)",
    "harvestables.heading.status": "Statusinformationen",
    "harvestables.field.currentStatus": "Aktueller Status:",
    "harvestables.field.initiallyHarvested": "Anfänglicher Harvest",
    "harvestables.field.lastHarvestStarted": "Letzter Harvest gestartet",
    "harvestables.field.lastHarvestFinished": "Letzter Harvest abgeschlossen",
    "harvestables.field.lastUpdated": "Zuletzt aktualisiert",
    "harvestables.field.message": "Nachricht des letzten Harvests",
    "harvestables.field.failedRecordsLogging.NO_STORE": "Fehlgeschlagene Datensätze nicht speichern",
    "harvestables.field.failedRecordsLogging.CLEAN_DIRECTORY": "Speichern. Verzeichnis zuvor bereinigen",
    "harvestables.field.failedRecordsLogging.CREATE_OVERWRITE": "Speichern. Vorhandene Dateien überschreiben",
    "harvestables.field.failedRecordsLogging.ADD_ALL": "Speichern. Nummerierte Versionen für bestehende Dateien hinzufügen",
    "SENTINEL": "SENTINEL",
    "harvestables.field.jobClass": "Jobklasse",
    "harvestables.field.jobClass.oaiPmh": "OAI-PMH",
    "harvestables.field.jobClass.xmlBulk": "XML-Bulk",
    "harvestables.field.jobClass.connector": "Harvest-Konnector",
    "harvestables.field.jobClass.status": "Statusbericht",
    "harvestables.column.currentStatus.SHUTDOWN": "Shutdown",
    "button.view-log": "Protokoll ansehen",
    "summary-table.summary": "Zusammenfassung",
    "summary-table.instances": "Instanz",
    "summary-table.holdings": "Bestand",
    "summary-table.items": "Exemplar",
    "summary-label.processed": "Verarbeitet",
    "summary-label.loaded": "Geladen",
    "summary-label.deleted": "Gelöscht(geskipped)",
    "summary-label.failed": "Fehlgeschlagen",
    "failed-records.recordNumber": "Datensatznummer",
    "failed-records.timeStamp": "Zeitstempel",
    "failed-records.instanceHrid": "Instanz-HRID",
    "failed-records.instanceTitle": "Instanztitel",
    "failed-records.errors": "Fehler",
    "harvestables.column.logFile": "Protokolldatei",
    "harvestables.column.records": "Datensätze",
    "logs.countFailedRecords": "{count, number} {count, plural, one {fehlgeschlagener Datensatz} other {fehlgeschlagene Datensätze}}",
    "stats.instances": "Instanz",
    "stats.holdings": "Bestand",
    "stats.items": "Exemplare",
    "nav.jobs": "Jobs",
    "nav.jobs-for": "Jobs für {name}",
    "button.old-jobs": "Alte Jobs",
    "logs.plainTextLog.running": "Live-Klartextprotokoll des aktuell laufenden Jobs",
    "logs.plainTextLog.previous": "Klartextprotokoll des letzten Jobs",
    "logs.plainTextLog.refresh": "Aktualisieren",
    "settings.storage": "Storage-Engines",
    "settings.pipeline": "Transformations-Pipelines",
    "settings.step": "Transformation-Steps",
    "permission.all": "Harvester Admin",
    "filter.date.started": "Startdatum",
    "filter.date.started.from": "Von",
    "filter.date.started.to": "Bis",
    "filter.date.finished": "Abschlussdatum",
    "filter.date.finished.from": "Von",
    "filter.date.finished.to": "Bis",
    "error.invalidSort.label": "Ungültiges Sortierkriterium",
    "error.invalidSort.content": "Aufgrund von Implementierungseinschränkungen ist eine Sortierung nach der Spalte <code>{name}</code> nicht möglich.",
    "jobs.index.name": "Name",
    "jobs.index.id": "ID",
    "jobs.index.harvestableId": "Harvestable-ID",
    "jobs.index.message": "Nachricht",
    "jobs.index.all": "(Alle)",
    "jobs.column.name": "Harvestable Name",
    "jobs.column.status": "Status",
    "jobs.column.amountHarvested": "Datensätze",
    "jobs.column.seconds": "Sekunden",
    "jobs.column.started": "Gestartet",
    "jobs.column.finished": "Abgeschlossen",
    "jobs.column.type": "Jobklasse",
    "jobs.column.message": "Nachricht (verarbeitet/geladen/gelöscht(geskipped)/fehlgeschlagen)",
    "nav.records": "Fehlgeschlagene Datensätze",
    "records.index.recordNumber": "Datensatznummer",
    "records.index.instanceHrid": "Instanz-HRID",
    "records.index.instanceTitle": "Instanztitel",
    "records.index.errors": "Fehler",
    "records.index.timeStamp": "Zeitstempel",
    "records.index.harvestableName": "Harvestable Name",
    "records.index.all": "(Alle)",
    "filter.date.timeStamp": "Zeitstempel",
    "filter.date.timeStamp.from": "Von",
    "filter.date.timeStamp.to": "Bis",
    "failed-records.harvestableName": "Harvestable Name",
    "button.view-log.current": "Aktuelles Protokoll",
    "button.view-log.last": "Letztes Protokoll",
    "harvestables.column.oldJobs": "Alte Jobs",
    "selectValue": "Wert auswählen",
    "fillIn": "Bitte dies ausfüllen, um fortzufahren",
    "selectToContinue": "Bitte auswählen, um fortzufahren",
    "filter.numeric.records": "Datensätze",
    "filter.numeric.records.from": "Mindestens",
    "filter.numeric.records.to": "Nicht mehr als",
    "settings.storage.heading": "Storage-Engines verwalten",
    "settings.pipeline.heading": "Transformations-Pipelines verwalten",
    "settings.step.heading": "Transformations-Steps verwalten",
    "storage.field.name": "Name",
    "storage.field.description": "Beschreibung",
    "storage.field.enabled": "Aktiviert",
    "storage.field.url": "URL",
    "storage.field.json": "JSON-Konfiguration",
    "storage.field.type": "Storage-Typ",
    "invalidJSON": "Ungültiges JSON: {error}",
    "op.run.error": "Job <b> {name} </b> konnte nicht gestartet werden: {error}",
    "op.stop.error": "Job <b> {name} </b> konnte nicht gestoppt werden: {error}",
    "logs.plainTextLog.download": "Herunterladen",
    "pipeline.field.name": "Name",
    "pipeline.field.description": "Beschreibung",
    "pipeline.field.enabled": "Aktiviert",
    "pipeline.field.parallel": "Parallel",
    "pipeline.field.stepAssociations": "Transformation-Steps",
    "pipeline.steps.position": "#",
    "pipeline.steps.name": "Name",
    "pipeline.steps.in": "In",
    "pipeline.steps.out": "Aus",
    "pipeline.steps.actions": "Aktionen",
    "step.field.name": "Name",
    "step.field.description": "Beschreibung",
    "step.field.enabled": "Aktiviert (dies ist unbenutzt)",
    "step.field.type": "Typ",
    "step.field.inputFormat": "Eingabeformat",
    "step.field.outputFormat": "Ausgabeformat",
    "step.field.script": "Skript",
    "step.field.testData": "Testdaten",
    "step.field.testOutput": "Testausgabe",
    "step.field.customClass": "Benutzerdefinierte Klasse",
    "harvestables.field.statusJobEnabled.help": "Leer",
    "harvestables.field.customMailAddresses.help": "Leer",
    "set-to-xml2json": "XML-zu-JSON auswählen",
    "export-csv": "CSV exportieren",
    "invalidXML": "Ungültiges XML: {error}",
    "invalidXSLT": "Gültiges XML, aber kein XSLT-Stylesheet",
    "validXSLT": "Gültiges XSLT-Stylesheet",
    "reports": "Berichte",
    "transform": "Transformieren",
    "nav.mike": "Mike",
    "permission.settings.view": "Harvester admin (Settings): View storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit": "Harvester admin (Settings): View, edit storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit-create": "Harvester admin (Settings): View, edit, create storage engines, transformation pipelines and transformation steps",
    "permission.settings.view-edit-create-delete": "Harvester admin (Settings): View, edit, create, delete storage engines, transformation pipelines and transformation steps",
    "permission.harvestables.view": "Harvester admin: View harvestables",
    "permission.harvestables.view-edit": "Harvester admin: View, edit harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create": "Harvester admin: View, edit, create harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create-delete": "Harvester admin: View, edit, create, delete harvestables, start/stop jobs",
    "permission.jobs-and-failed-records.view": "Harvester admin: View jobs and failed records"
}