{
    "meta.title": "Cosechadora admin",
    "no-value": "-",
    "error": "Algo salió mal",
    "resultCount": "{count, number} {count, plural, one  {registro encontrado} other {registros encontrados}}",
    "add": "Añadir",
    "actions.new": "Nuevo registro",
    "actions.new.harvestable.oaiPmh": "OAI-PMH cosechable",
    "actions.new.harvestable.xmlBulk": "XML a granel cosechable",
    "actions.new.harvestable.connector": "Conector cosechable",
    "actions.new.harvestable.status": "Estado-informe cosechable",
    "nav.harvestables": "Cosechables",
    "button.edit": "Editar",
    "button.delete": "Borrar",
    "button.start-job": "Iniciar trabajo",
    "button.stop-job": "Dejar de trabajar",
    "button.confirm": "Confirme",
    "op.delete.confirm": "¿Estás seguro de que quieres borrar este registro?",
    "op.delete.completed": "Registro <b>{name}</b> eliminado",
    "op.run.completed": "Trabajo <b>{name}</b> iniciado",
    "op.stop.completed": "Trabajo <b>{name}</b> detenido",
    "harvestables.column.name": "Nombre",
    "harvestables.column.currentStatus": "Estado",
    "harvestables.column.lastHarvestFinished": "Última cosecha terminada",
    "harvestables.column.enabled": "¿Habilitado?",
    "harvestables.column.jobClass": "Clase de empleo",
    "harvestables.column.id": "ID",
    "harvestables.column.message": "Mensaje (procesado/cargado/borrado/fallido)",
    "harvestables.column.enabled.true": "Sí",
    "harvestables.column.enabled.false": "No",
    "harvestables.column.jobClass.OaiPmhResource": "OAI-PMH",
    "harvestables.column.jobClass.XmlBulkResource": "XML a granel",
    "harvestables.column.jobClass.HarvestConnectorResource": "Conector de cosecha",
    "harvestables.column.jobClass.StatusResource": "Informe de situación",
    "harvestables.column.currentStatus.NEW": "Nuevo",
    "harvestables.column.currentStatus.OK": "DE ACUERDO",
    "harvestables.column.currentStatus.WARN": "Advertencia",
    "harvestables.column.currentStatus.ERROR": "Error",
    "harvestables.column.currentStatus.RUNNING": "Ejecutar",
    "harvestables.column.currentStatus.FINISHED": "Terminado",
    "harvestables.column.currentStatus.KILLED": "Asesinado",
    "harvestables.index.name": "Nombre",
    "harvestables.index.id": "ID",
    "harvestables.index.message": "Mensaje",
    "searchInputLabel": "XXX searchInputLabel",
    "accordion.devinfo": "Información para desarrolladores",
    "harvestables.heading.general": "Información general",
    "harvestables.field.id": "Id",
    "harvestables.field.id.help": "Identificador asignado automáticamente al trabajo",
    "harvestables.field.name": "Nombre",
    "harvestables.field.name.help": "Preferiblemente, un nombre único para que los usuarios identifiquen este recurso Harvester. En algunos casos, el nombre puede proponerse después de rellenar la sección específica del protocolo de la configuración (por ejemplo, Conectores de datos de índices, OAI-PMH).",
    "harvestables.field.serviceProvider": "Proveedor de servicios",
    "harvestables.field.serviceProvider.help": "Campo de texto libre utilizado por el personal de apoyo para registrar información administrativa. No lo utiliza el recolector.",
    "harvestables.field.usedBy": "Utilizado por",
    "harvestables.field.usedBy.help": "Campo de texto libre para etiquetar un trabajo con el público objetivo previsto, como un grupo de usuarios o un cliente del recurso. Varias etiquetas de usuario/cliente pueden estar separadas por comas. Las etiquetas se pueden usar para filtrar informes de estado por usos/clientes.",
    "harvestables.field.managedBy": "Gestionado por",
    "harvestables.field.managedBy.help": "Campo de texto libre para etiquetar un trabajo con el productor o gestor del recurso. Se pueden separar varias etiquetas mediante comas. Los administradores de trabajos pueden utilizar las etiquetas para filtrar los informes de estado.",
    "harvestables.field.openAccess": "¿Recurso de libre acceso?",
    "harvestables.field.description": "Descripción del contenido",
    "harvestables.field.description.help": "Campo de texto libre utilizado por el personal de apoyo para registrar información administrativa. No lo utiliza el recolector.",
    "harvestables.field.technicalNotes": "Notas técnicas",
    "harvestables.field.technicalNotes.help": "Campo de texto libre utilizado por el personal de apoyo para registrar información administrativa. No lo utiliza el recolector.",
    "harvestables.field.contactNotes": "Notas de contacto",
    "harvestables.field.contactNotes.help": "Campo de texto libre utilizado por el personal de apoyo para registrar información administrativa. No lo utiliza el recolector.",
    "harvestables.field.enabled": "¿Trabajo de recolección habilitado?",
    "harvestables.field.enabled.help": "Marque para ejecutar el trabajo de cosecha como se describe en el tiempo/intervalo seleccionado en \"Programación de cosecha\". Dejar esta casilla sin marcar hará que el trabajo esté inactivo.",
    "harvestables.field.scheduleString": "Calendario de la cosecha",
    "harvestables.field.scheduleString.help": "Utilice estos campos para definir un tiempo/intervalo recurrente en el que se debe ejecutar el trabajo Harvester. Por ejemplo, para las tiradas semanales, especifique un día de la semana en el que se debe ejecutar la cosecha.",
    "harvestables.field.scheduleString.harvest": "Cosecha",
    "harvestables.field.scheduleString.day": "(día) de",
    "harvestables.field.scheduleString.month": "(mes) si es",
    "harvestables.field.scheduleString.weekday": "(día de la semana)",
    "harvestables.field.scheduleString.time": "Tiempo de cosecha",
    "harvestables.field.scheduleString.hour": "(hour in 24 format)",
    "harvestables.field.scheduleString.minute": "(min)",
    "harvestables.field.transformationPipeline": "Proceso de transformación",
    "harvestables.field.transformationPipeline.help": "Seleccione la transformación necesaria para hacer coincidir el formato de entrada entregado por la fuente con el formato interno utilizado por el Harvester para el almacenamiento de datos. Consulte la sección Manual de canalizaciones de transformación para obtener más detalles.",
    "harvestables.field.laxParsing": "Utilice un análisis sintáctico laxo (si es posible)",
    "harvestables.field.laxParsing.help": "Si esta opción está activada, Harvester intentará analizar XML malformado (sin etiquetas de cierre, entidades).",
    "harvestables.field.encoding": "Modificación de la codificación (ISO-8859-1, UTF-8, ...)",
    "harvestables.field.encoding.help": "Una fuente puede devolver respuestas codificadas no válidas, como tener un encabezado XML con codificación establecida en UTF-8, pero en realidad devolver ISO-8859-1 en los datos. Establecer este campo en la codificación real obligará al Harvester a utilizar la codificación especificada.",
    "harvestables.field.storage.name": "Almacenamiento",
    "harvestables.field.storage.name.help": "Seleccione el tipo de almacenamiento y la ubicación de los datos recopilados. El Harvester tiene una capa de abstracción de almacenamiento para permitirle trabajar con múltiples sistemas potenciales de almacenamiento de registros, pero en la actualidad, solo se admite Solr / Lucene. Una vez seleccionado el Almacenamiento, es posible ver los registros indexados haciendo clic en el campo Registros almacenados: haga clic para ver.",
    "harvestables.field.storageBatchLimit": "Límite del lote de almacenamiento",
    "harvestables.field.cacheEnabled": "¿Caché en disco?",
    "harvestables.field.cacheEnabled.help": "Si se activa, los datos de la recolección se guardan en la caché del sistema de archivos y el trabajo puede reiniciarse desde esta caché sin necesidad de volver al servidor.",
    "harvestables.field.storeOriginal": "¿Almacenar el contenido original del disco?",
    "harvestables.field.recordLimit": "Limitar el número de registros a",
    "harvestables.field.recordLimit.help": "Limitar la ejecución de la recolección a un número especificado de registros: útil para probar la configuración del trabajo y los conductos de transformación.",
    "harvestables.field.timeout": "Tiempo de espera de conexión/lectura (segundos)",
    "harvestables.field.timeout.help": "Especifique un valor de tiempo de espera no predeterminado para obtener y leer de la conexión de red (socket). No se recomiendan valores inferiores a 1 minuto.",
    "harvestables.field.logLevel": "Nivel de registro",
    "harvestables.field.logLevel.help": "Especifique el nivel de registro para el trabajo, siendo DEBUG el más detallado. INFO es el nivel de registro recomendado en la mayoría de los casos.",
    "harvestables.field.failedRecordsLogging": "Guardar registros fallidos",
    "harvestables.field.failedRecordsLogging.help": "Especifique si los registros fallidos deben guardarse como archivos XML en un directorio de registro designado. Especifique también la política de retención para el directorio, es decir, si se deben conservar los archivos guardados en ejecuciones anteriores y, en caso afirmativo, si se debe sobrescribir un archivo existente si el mismo registro vuelve a fallar o si se debe añadir un número de secuencia al nombre del nuevo archivo para no sobrescribirlo.",
    "harvestables.field.maxSavedFailedRecordsPerRun": "Número máximo de registros fallidos guardados en la siguiente ejecución",
    "harvestables.field.maxSavedFailedRecordsPerRun.help": "Establece un número máximo de archivos para guardar en el directorio de registros con errores por ejecución. El registro de trabajos indicará cuándo se alcanza el límite.",
    "harvestables.field.maxSavedFailedRecordsTotal": "Número máximo de registros fallidos guardados en total",
    "harvestables.field.maxSavedFailedRecordsTotal.help": "Establece un número máximo de archivos que se guardarán en el directorio de registros con errores en un momento dado, como la suma de los registros guardados anteriormente (que no se limpiaron antes de esta ejecución) más los registros nuevos agregados durante la ejecución. El registro de trabajos indicará cuándo se alcanza el límite.",
    "harvestables.field.mailAddress": "Direcciones de correo electrónico de notificación",
    "harvestables.field.mailAddresses": "Direcciones de correo electrónico de notificación",
    "harvestables.field.mailAddresses.help": "Lista de direcciones de correo electrónico que deben recibir notificación sobre la finalización del trabajo.",
    "harvestables.field.mailLevel": "Enviar notificación si la gravedad es al menos",
    "harvestables.field.mailLevel.help": "especifique el estado de finalización del trabajo con la menor gravedad que activará la notificación por correo electrónico.",
    "harvestables.field.constantFields": "Lista de campos constantes",
    "harvestables.field.constantFields.help": "Lista de pares NOMBRE=VALOR. Para un recolectable que tiene este campo establecido, cada registro recolectado tiene cada campo NAME establecido al VALUE correspondiente.",
    "harvestables.field.json": "Configuración adicional: (JSON)",
    "harvestables.field.json.help": "Especifique la configuración avanzada adicional de la cosechadora en formato JSON.",
    "harvestables.field.type.oaiPmh": "Información específica de OAI-PMH",
    "harvestables.field.url": "URL del repositorio OAI",
    "harvestables.field.url.help": "Introduzca un vínculo (basado en http) al recurso que se va a recopilar. Incluya el enlace base definido por OAI Set Name: (ver más abajo). Algunos recursos tienen varios conjuntos dentro del repositorio. Si la URL no identifica ningún conjunto específico, se recopilará el repositorio completo.",
    "harvestables.field.oaiSetName": "Nombre del conjunto OAI (tipo para sugerencias)",
    "harvestables.field.oaiSetName.help": "un parámetro opcional, un valor OAI-PMH setSpec que especifica los criterios establecidos para la recolección selectiva.",
    "harvestables.field.metadataPrefix": "Prefijo de metadatos",
    "harvestables.field.metadataPrefix.help": "Cadena que especifica el formato de los metadatos en las solicitudes OAI-PMH emitidas a un repositorio objetivo. Es importante elegir el formato correcto o no se recogerán datos del repositorio. Asegúrese de seleccionar una Cadena de Transformación que coincida con el formato de metadatos utilizado en el repositorio, de lo contrario los registros no serán entendidos por el Recolector. Los repositorios suelen utilizar uno de los siguientes prefijos (o formatos de datos incrustados): Dublin Core (OAI-DC) o MARC XML (MARC12/USMARC). Otros valores MetadataPrefix menos comunes incluyen PMC (registros de texto completo de PubMed Central), PMC (registros de metadatos de PubMed Central) y PZ2 (pazpar2).",
    "harvestables.field.dateFormat": "Formato de fecha",
    "harvestables.field.useLongDateFormat": "Utilizar el formato de fecha largo",
    "harvestables.field.useLongDateFormat.help": "Casilla de verificación para indicar si se utiliza un formato de fecha largo al solicitar registros del recurso OAI-PMH. No se utiliza muy a menudo, pero algunos recursos lo exigen.",
    "harvestables.field.fromDate": "Cosecha de",
    "harvestables.field.fromDate.help": "Si está vacío y no se ha establecido ningún token de reanudación, la cosechadora recogerá el conjunto de datos completo del recurso. Cuando este campo contiene un valor, al finalizar el trabajo, la cosechadora restablecerá el valor de este campo al día anterior a la fecha de ejecución actual, de modo que las ejecuciones posteriores sólo recogerán registros nuevos.",
    "harvestables.field.untilDate": "Cosecha hasta",
    "harvestables.field.untilDate.help": "Límite superior de fecha para la recolección selectiva. En recorridos consecutivos, la cosechadora borrará este campo haciendo que el intervalo de fechas sea indefinido.",
    "harvestables.field.resumptionToken": "Ficha de reanudación (anula la fecha)",
    "harvestables.field.resumptionToken.help": "El protocolo OAI-PMH permite dividir grandes conjuntos de datos en trozos más pequeños. Al entregar un fragmento de registros, OAI-PMH devuelve un token que la siguiente solicitud deberá utilizar para obtener el siguiente fragmento. Si un trabajo OAI-PMH se detiene antes de completarse, el token de reanudación se establecerá en este campo. A veces es posible volver a ejecutarlo desde este punto de reanudación en una fase posterior, pero esto no siempre es posible.",
    "harvestables.field.clearRtOnError": "Borrar token de reanudación en errores de conexión",
    "harvestables.field.clearRtOnError.help": "Borra el token de reanudación para las cosechas que finalizan en estado de error. Esto es útil cuando el servidor falla y el último token de reanudación ya no es válido.",
    "harvestables.field.keepPartial": "Conservar las cosechas parciales",
    "harvestables.field.keepPartial.help": "Si se selecciona esta opción, los registros parciales recogidos durante una recolección fallida se conservarán en el almacén.",
    "harvestables.field.retryCount": "Recuento de reintentos de solicitud",
    "harvestables.field.retryCount.help": "Especifique cuántas veces la cosechadora debe volver a intentar solicitudes de cosecha fallidas, 0 deshabilita el reintento por completo.",
    "harvestables.field.retryWait": "Retraso antes del reintento (segundos)",
    "harvestables.field.retryWait.help": "Retraso para reintentar peticiones fallidas. Sólo cambiar cuando el recurso no funciona con los valores por defecto.",
    "harvestables.field.type.xmlBulk": "Información específica del volumen XML",
    "harvestables.field.urls": "URL",
    "harvestables.field.urls.help": "Una o más URL separadas por espacios (HTTP o FTP) para datos binarios XML o MARC. Se admiten páginas de salto o índice (páginas HTML con URL) y también los directorios FTP. Para FTP, la recolección de directorios recursivos se puede habilitar a continuación.",
    "harvestables.field.allowErrors": "¿Continuar con los errores?",
    "harvestables.field.allowErrors.help": "Marque esta opción para seguir recopilando y almacenando registros aunque falle la recuperación de algunos de los recursos enumerados.",
    "harvestables.field.overwrite": "¿Sobrescribir los datos con cada ejecución (no incremental)?",
    "harvestables.field.overwrite.help": "Seleccione esta opción para eliminar todos los datos recopilados anteriormente antes de iniciar la siguiente ejecución programada (o activada manualmente). Esta opción puede utilizarse cuando en el servidor residen volcados de catálogo completos.    Con FOLIO Inventory Storage no se borran todos los datos recolectados previamente, por lo que esta opción indica que los registros existentes deben superponerse.",
    "harvestables.field.allowCondReq": "¿Pedir al servidor sólo archivos nuevos (incremental)?",
    "harvestables.field.allowCondReq.help": "Preguntar al servidor si los archivos han sido modificados antes de intentar una recolección, depende de la correcta gestión de las marcas de tiempo en el lado del servidor. Normalmente es seguro tener esta opción activada, ya que los servidores están ansiosos por actualizar la fecha de modificación, incluso en los casos en los que los propios archivos no cambian. Activar esta opción puede acortar significativamente los tiempos de recolección.",
    "harvestables.field.initialFromDate": "Fecha inicial de inicio (si es incremental)",
    "harvestables.field.initialFromDate.help": "Permite especificar la fecha inicial de cosecha cuando se marca la opción de <strong>solo solicitar al servidor nuevos archivos</strong>. Cuando se rellenen, solo se recopilarán los archivos más recientes que la fecha especificada.    Con FOLIO Inventory Storage, la configuración indica además que solo se deben cargar los registros entrantes que se actualizaron en esta fecha o después. Además, para que esto surta efecto, los registros entrantes deben proporcionar un 'lastUpdated' en el elemento 'processing' y en el formato AAAA-MM-DD &lt;processing&gt; &lt;lastUpdated&gt;1970-01-01&lt;/lastUpdated&gt; &lt;/processing&gt; De forma predeterminada, la lógica se filtraría por la fecha de finalización de la última cosecha, por lo que establecer 'Fecha inicial a partir de' anula el comportamiento predeterminado.   Por lo tanto, se aplican las siguientes reglas: <li>si se marca 'Sobrescribir datos', se cargan todos los registros.</li>  De lo contrario: Si los registros entrantes proporcionan una fecha 'lastUpdated' y se establece la 'Fecha inicial desde', solo <li>se cargarán los registros actualizados en o después de esa fecha (esto es independientemente de si 'Solicitar al servidor solo archivos nuevos (incremental)' está marcado o no) Si los registros entrantes proporcionan una fecha 'lastUpdated' y la</li> <li>'Fecha inicial desde' NO está establecida,   entonces solo se cargarán los registros actualizados en o después de la última fecha de cosecha</li> Pero <li>se cargará cualquier registro sin una fecha 'lastUpdated' </li>",
    "harvestables.field.splitAt": "Dividir XML en profundidad (cero/vacío desactiva la división)",
    "harvestables.field.splitAt.help": "Para datos XML. Por lo general, esto se debe establecer en 1 para los feeds XML, si queremos cosechar los elementos de registro en los datos estructurados como: <root> <record/> <record/> </root>.",
    "harvestables.field.splitSize": "Dividir archivos según el número de registros (cero/vacío desactiva la división)",
    "harvestables.field.splitSize.help": "El cosechador intenta, en la medida de lo posible, realizar un análisis sintáctico en tiempo real, pero muchas transformaciones XSL no lo permiten. Intentar transformar millones de registros consumirá demasiada memoria, por lo que dividir el recurso en trozos de 1000 registros parece una opción razonable. Introduzca en este campo el número de registros que contendrá cada trozo.",
    "harvestables.field.expectedSchema": "Modificación del tipo MIME (por ejemplo: application/marc; charset=MARC-8)",
    "harvestables.field.expectedSchema.help": "El Harvester detecta el tipo (XML vs binario MARC) a partir del tipo MIME y la extensión del archivo. También es capaz de tratar con archivos comprimidos (zip, tar, gzip), en algún caso raro puede ser necesario proporcionar el tipo de contenido manualmente (por ejemplo, si falta o es incorrecto), el formato es:   MIME-type [; codificación de caracteres opcional].",
    "harvestables.field.outputSchema": "Formato de transformación MARC XML (application/marc o application/tmarc)",
    "harvestables.field.outputSchema.help": "Este campo expresa el formato de salida de la lectura binaria de MARC, que también será el formato de entrada para el proceso de transformación. Si el proceso de transformación espera MARC21 XML, debe establecerse como Application/marc. Si el proceso espera Turbo MARC XML, debe establecerse como Application/tmarc.",
    "harvestables.field.recurse": "¿Recurrir a subcarpetas?",
    "harvestables.field.recurse.help": "Si está activada, el recolector recorrerá todo el árbol de directorios y buscará los archivos que se puedan recolectar. Esta opción debe activarse con cuidado.",
    "harvestables.field.includeFilePattern": "Incluir archivos (expresión regular)",
    "harvestables.field.includeFilePattern.help": "Esta opción se puede utilizar para filtrar los archivos que se van a recoger.  El filtro se aplica tanto a ficheros en directorios FTP como en archivos comprimidos (ZIP/tar).  Cuando se establece una expresión regular, el recolector sólo recolectará archivos cuyos nombres coincidan con la expresión regular (a menos que el nombre del archivo esté excluido al mismo tiempo por un patrón de exclusión).   Ejemplo: . <pre>*\\.xml|.*\\.marc</pre> Sólo incluirá archivos .xml y .marc.    Tenga en cuenta que los puntos de los nombres de archivo deben escaparse.    Tenga en cuenta que los archivos ZIP y tar (.zip,.gz,.tar) se cargan aunque no se especifiquen en el patrón de inclusión. Para forzar la exclusión de archivos ZIP o tar tendrían que ser especificados en un patrón de exclusión (ver texto de ayuda para ello).",
    "harvestables.field.excludeFilePattern": "Excluir archivos (expresión regular)",
    "harvestables.field.excludeFilePattern.help": "Esta opción se puede utilizar para filtrar los archivos que se van a recopilar. El filtro se aplica tanto a ficheros en directorios FTP como a entradas en archivos comprimidos (ZIP/tar).  Cuando se establece una expresión regular, el recolector omitirá cualquier archivo cuyo nombre coincida con la expresión. Ejemplo: <pre>readme\\.txt|README|.*\\.jpg|.*\\.gif</pre> Excluiría archivos con nombres readme.txt, README así como archivos .jpg y .gif de directorios FTP o archivos ZIP/tar.",
    "harvestables.field.passiveMode": "¿Utilizar el modo pasivo para las transferencias FTP?",
    "harvestables.field.passiveMode.help": "When set passive, instead of active, mode is  used for FTP connections. If harvester is running within a restricted firewall that  blocks FTP active mode connections, enabling this setting might help. It might be,  however, necessary to align this mode with what FTP server expects.",
    "harvestables.field.csvConfiguration": "Configuración del analizador CSV",
    "harvestables.field.csvConfiguration.help": "El recolector detectará (ya sea por el tipo MIME o por la extensión del archivo) e intentará analizar los archivos CSV (valores separados por comas) en una representación XML para su posterior procesamiento. La representación XML de cada fila de datos tiene el siguiente aspecto: <pre>&lt;row&gt;&lt;field name=\"nombre o número de columna\"&gt;valor de campo&lt;/field&gt;...&lt;/row&gt;</pre> A menos que la opción de división en profundidad se establezca en > 0, todas las filas se analizarán en un único documento XML y se envolverán con un elemento raíz &lt;rows&gt; adicional. Para archivos CSV de gran tamaño, puede ser una buena idea establecer la división en profundidad en 1. La configuración del analizador se expresa en una lista clave/valor delimitada por punto y coma, como por ejemplo: clave1=valor1; clave2=valor2. La lista de opciones admitidas es la siguiente <ul> <li> charset: por defecto \"iso-8859-1\", especifica la codificación de caracteres de los archivos</li> <li> delimiter: por defecto \",\" para CSV y \"\\t\" para TSV, especifica el delimitador de campo utilizado en los archivos</li> <li> containsHeader: por defecto \"yes\", especifica si la primera línea de los ficheros contiene la línea de cabecera</li> <li> headerLine: no por defecto, permite anular o especificar las cabeceras, el formato es una lista separada por comas p.ej. headers=\"título,autor,descripción\"</li></ul>",
    "harvestables.field.type.connector": "Información específica del conector",
    "harvestables.field.connectorEngineUrlSetting.label": "Motor CF",
    "harvestables.field.connectorEngineUrlSetting.label.help": "Seleccione la instancia de Connector Engine que se utilizará para ejecutar el trabajo de recopilación de Connector. El motor predeterminado está alojado en Index Data, pero también puede instalarse localmente en el sitio del cliente. Se pueden especificar motores de conectores adicionales a través de la pestaña Configuración.",
    "harvestables.field.engineParameters": "Parámetros del motor (opcional)",
    "harvestables.field.engineParameters.help": "Valores adicionales o personalizados de los parámetros de sesión del motor del conector utilizados por este trabajo. Consulte la página de manual de CFWS para obtener más información.",
    "harvestables.field.connectorRepoUrlSetting.label": "Repositorio CF",
    "harvestables.field.connectorRepoUrlSetting.label.help": "Seleccione el repositorio de conectores donde se alojan y mantienen los conectores. Normalmente, el repositorio de conectores lo proporciona Index Data y puede requerir una cuenta de inicio de sesión. Las credenciales de la cuenta se proporcionan directamente en la configuración de URL del repositorio de conectores a la que se accede desde la pestaña Configuración y deben tener la forma: <pre>http(s)://&lt;repouser&gt;:&lt;repopass&gt;@url.to.the.repository</pre>.",
    "harvestables.field.connector": "Conector (tipo a modo de sugerencia)",
    "harvestables.field.connector.help": "Introduzca aquí el nombre del conector de recolección específico del recurso cosechado. Este campo proporciona sugerencias buscando el repositorio, por lo que solo se requiere un par de caracteres iniciales o una parte del nombre.",
    "harvestables.field.overwrite-connector.help": "Compruebe que se eliminan todos los datos recopilados anteriormente antes de iniciar la siguiente ejecución programada (o activada manualmente).",
    "harvestables.field.connuser": "Nombre de usuario",
    "harvestables.field.connuser.help": "Nombre de usuario necesario para acceder a un recurso recolectado que requiere autenticación.",
    "harvestables.field.password": "Contraseña",
    "harvestables.field.password.help": "Contraseña necesaria para acceder a un recurso recolectado que requiere autenticación.",
    "harvestables.field.proxy": "Dirección del servidor proxy",
    "harvestables.field.proxy.help": "Dirección del servidor proxy que debe utilizar el motor de recolección, por ejemplo, para tratar los casos en que el recurso está autenticado por IP.",
    "harvestables.field.initData": "Datos Init",
    "harvestables.field.initData.help": "Configuración avanzada para proporcionar parámetros de inicialización adicionales al conector de recolección. Cualquier nombre de usuario/contraseña/proxy especificado en las entradas anteriores tendrá prioridad sobre la configuración especificada en este campo. Esta configuración debe proporcionarse en formato JSON.",
    "harvestables.field.startToken": "Token de inicio (cosecha incremental)",
    "harvestables.field.startToken.help": "El uso de un token de inicio para la recolección incremental es específico del conector y depende de la capacidad del conector. Esta configuración debe proporcionarse en formato JSON.",
    "harvestables.field.sleep": "Retraso entre solicitudes (milisegundos)",
    "harvestables.field.sleep.help": "Retraso entre las solicitudes realizadas desde el recolector al motor del conector. Utilizar cuando el recurso es sensible a cargas elevadas.",
    "harvestables.field.failedRetryCount": "Recuento de solicitudes fallidas",
    "harvestables.field.failedRetryCount.help": "Especifique cuántas veces la cosechadora debe volver a intentar solicitudes de cosecha fallidas, 0 deshabilita el reintento por completo.",
    "harvestables.field.type.status": "Información general",
    "harvestables.field.usageTags": "Filtro: lista de etiquetas de uso",
    "harvestables.field.usageTags.help": "Se utiliza para filtrar el informe de estado por los grupos de usuarios de los clientes etiquetados en una tarea de recolección (\"Utilizado por\").",
    "harvestables.field.adminTags": "Filtro: lista de etiquetas admin",
    "harvestables.field.adminTags.help": "Se utiliza para filtrar el informe de estado por el creador o administrador de la tarea de recolección, etiquetado como \"Gestionado por\".",
    "harvestables.field.statusJobEnabled": "Estado del trabajo activado",
    "harvestables.field.customMailAddresses": "Direcciones de correo electrónico personalizadas (separadas por comas)",
    "harvestables.heading.status": "Información de estado",
    "harvestables.field.currentStatus": "Situación actual:",
    "harvestables.field.initiallyHarvested": "Cosecha inicial",
    "harvestables.field.lastHarvestStarted": "Comenzó la última cosecha",
    "harvestables.field.lastHarvestFinished": "Última cosecha finalizada",
    "harvestables.field.lastUpdated": "Última actualización",
    "harvestables.field.message": "Mensaje de la última cosecha:",
    "harvestables.field.failedRecordsLogging.NO_STORE": "No guardar registros fallidos",
    "harvestables.field.failedRecordsLogging.CLEAN_DIRECTORY": "Guardar. Limpiar directorio primero",
    "harvestables.field.failedRecordsLogging.CREATE_OVERWRITE": "Guardar. Sobrescribir archivos existentes",
    "harvestables.field.failedRecordsLogging.ADD_ALL": "Guardar. Añadir versiones numeradas para archivos existentes",
    "SENTINEL": "SENTINEL",
    "harvestables.field.jobClass": "clase de trabajo",
    "harvestables.field.jobClass.oaiPmh": "OAI-PMH",
    "harvestables.field.jobClass.xmlBulk": "XML a granel",
    "harvestables.field.jobClass.connector": "Conector de cosecha",
    "harvestables.field.jobClass.status": "Informe de estado",
    "harvestables.column.currentStatus.SHUTDOWN": "Cierre",
    "button.view-log": "Ver registro",
    "summary-table.summary": "Resumen",
    "summary-table.instances": "Instancia",
    "summary-table.holdings": "Holdings",
    "summary-table.items": "Ejemplar",
    "summary-label.processed": "Procesado",
    "summary-label.loaded": "Cargado",
    "summary-label.deleted": "Suprimido",
    "summary-label.failed": "Fallido",
    "failed-records.recordNumber": "Número de registro",
    "failed-records.timeStamp": "Sello de tiempo",
    "failed-records.instanceHrid": "Instancia HRID",
    "failed-records.instanceTitle": "Título de la instancia",
    "failed-records.errors": "errores",
    "harvestables.column.logFile": "Archivo de registro",
    "harvestables.column.records": "Registros",
    "logs.countFailedRecords": "{count, number} {count, plural, one {registro fallido} other {registros fallidos}}",
    "stats.instances": "Instancias",
    "stats.holdings": "Holdings",
    "stats.items": "Ítems",
    "nav.jobs": "Empleo",
    "nav.jobs-for": "Empleo para {name}",
    "button.old-jobs": "Antiguos empleos",
    "logs.plainTextLog.running": "Registro en texto plano del trabajo en ejecución",
    "logs.plainTextLog.previous": "Registro en texto plano del último trabajo",
    "logs.plainTextLog.refresh": "Actualizar",
    "settings.storage": "Motores de almacenamiento",
    "settings.pipeline": "Procesos de transformación",
    "settings.step": "Pasos de la transformación",
    "permission.all": "Cosechadora admin",
    "filter.date.started": "Fecha de inicio",
    "filter.date.started.from": "De",
    "filter.date.started.to": "A",
    "filter.date.finished": "Fecha de finalización",
    "filter.date.finished.from": "De",
    "filter.date.finished.to": "A",
    "error.invalidSort.label": "Criterio de clasificación no válido",
    "error.invalidSort.content": "No es posible ordenar en la columna <code>{name}</code> debido a limitaciones de implementación.",
    "jobs.index.name": "Nombre",
    "jobs.index.id": "IDENTIFICACIÓN",
    "jobs.index.harvestableId": "Identificación cosechable",
    "jobs.index.message": "Mensaje",
    "jobs.index.all": "(Todos)",
    "jobs.column.name": "Nombre cosechable",
    "jobs.column.status": "Estado",
    "jobs.column.amountHarvested": "Registros",
    "jobs.column.seconds": "Segundos",
    "jobs.column.started": "Comenzó",
    "jobs.column.finished": "Terminado",
    "jobs.column.type": "Clase de empleo",
    "jobs.column.message": "Mensaje (procesado/cargado/borrado/fallido)",
    "nav.records": "Registros fallidos",
    "records.index.recordNumber": "Número de registro",
    "records.index.instanceHrid": "Instancia hrid",
    "records.index.instanceTitle": "Título de la instancia",
    "records.index.errors": "Errores",
    "records.index.timeStamp": "Sello de tiempo",
    "records.index.harvestableName": "Nombre cosechable",
    "records.index.all": "(Todos)",
    "filter.date.timeStamp": "Sello de tiempo",
    "filter.date.timeStamp.from": "De",
    "filter.date.timeStamp.to": "A",
    "failed-records.harvestableName": "Nombre cosechable",
    "button.view-log.current": "Registro actual",
    "button.view-log.last": "Último registro",
    "harvestables.column.oldJobs": "Antiguos empleos",
    "selectValue": "Seleccione un valor",
    "fillIn": "Rellene este formulario para continuar",
    "selectToContinue": "Seleccione para continuar",
    "filter.numeric.records": "Registros",
    "filter.numeric.records.from": "Por lo menos",
    "filter.numeric.records.to": "No más de",
    "settings.storage.heading": "Gestionar motores de almacenamiento",
    "settings.pipeline.heading": "Gestionar los procesos de transformación",
    "settings.step.heading": "Gestionar los pasos de la transformación",
    "storage.field.name": "Nombre",
    "storage.field.description": "Descripción",
    "storage.field.enabled": "Habilitado",
    "storage.field.url": "URL",
    "storage.field.json": "Configuración JSON",
    "storage.field.type": "Tipo de almacenamiento:",
    "invalidJSON": "JSON inválido: {error}",
    "op.run.error": "No se ha podido iniciar el trabajo <b>{name}</b>: {error}",
    "op.stop.error": "No se ha podido detener la tarea <b>{name}</b>: {error}",
    "logs.plainTextLog.download": "Descargar",
    "pipeline.field.name": "Nombre",
    "pipeline.field.description": "Descripción",
    "pipeline.field.enabled": "Activado",
    "pipeline.field.parallel": "Paralelo",
    "pipeline.field.stepAssociations": "Pasos de la transformación",
    "pipeline.steps.position": "#",
    "pipeline.steps.name": "Nombre",
    "pipeline.steps.in": "En",
    "pipeline.steps.out": "Afuera",
    "pipeline.steps.actions": "Acciones",
    "step.field.name": "Nombre",
    "step.field.description": "Descripción",
    "step.field.enabled": "Activado (No se utiliza)",
    "step.field.type": "Tipo",
    "step.field.inputFormat": "Formato de entrada",
    "step.field.outputFormat": "Formato de salida",
    "step.field.script": "Guión",
    "step.field.testData": "Datos de la prueba",
    "step.field.testOutput": "Resultado de la prueba",
    "step.field.customClass": "Clase personalizada",
    "harvestables.field.statusJobEnabled.help": "",
    "harvestables.field.customMailAddresses.help": "",
    "set-to-xml2json": "Choose XML-to-JSON",
    "export-csv": "Export CSV",
    "invalidXML": "Invalid XML: {error}",
    "invalidXSLT": "Valid XML, but not an XSLT stylesheet",
    "validXSLT": "Valid XSLT stylesheet",
    "reports": "Reports",
    "transform": "Transform",
    "nav.mike": "Mike",
    "permission.settings.view": "Harvester admin (Settings): View storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit": "Harvester admin (Settings): View, edit storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit-create": "Harvester admin (Settings): View, edit, create storage engines, transformation pipelines and transformation steps",
    "permission.settings.view-edit-create-delete": "Harvester admin (Settings): View, edit, create, delete storage engines, transformation pipelines and transformation steps",
    "permission.harvestables.view": "Harvester admin: View harvestables",
    "permission.harvestables.view-edit": "Harvester admin: View, edit harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create": "Harvester admin: View, edit, create harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create-delete": "Harvester admin: View, edit, create, delete harvestables, start/stop jobs",
    "permission.jobs-and-failed-records.view": "Harvester admin: View jobs and failed records"
}