{
    "meta.title": "Harvester-admin",
    "no-value": "-",
    "error": "Er heeft zich een fout voorgedaan.",
    "resultCount": "{count, number} {count, plural, one {record found} other {records found}}",
    "add": "Toevoegen",
    "actions.new": "Nieuw record",
    "actions.new.harvestable.oaiPmh": "OAI-PMH harvestable",
    "actions.new.harvestable.xmlBulk": "XML-bulk harvestable",
    "actions.new.harvestable.connector": "Connector harvestable",
    "actions.new.harvestable.status": "Status-rapport harvestable",
    "nav.harvestables": "Harvestables",
    "button.edit": "Bewerken",
    "button.delete": "Verwijderen",
    "button.start-job": "Taak starten",
    "button.stop-job": "Taak stoppen",
    "button.confirm": "Bevestigen",
    "op.delete.confirm": "Weet u zeker dat u dit record wilt verwijderen?",
    "op.delete.completed": "Record <b>{name}</b> verwijderd",
    "op.run.completed": "Taak <b>{name}</b> gestart",
    "op.stop.completed": "Taak <b>{name}</b> gestopt",
    "harvestables.column.name": "Naam",
    "harvestables.column.currentStatus": "Status",
    "harvestables.column.lastHarvestFinished": "Laatste harvest voltooid",
    "harvestables.column.enabled": "Ingeschakeld?",
    "harvestables.column.jobClass": "Taak",
    "harvestables.column.id": "ID",
    "harvestables.column.message": "Bericht (verwerkt/geladen/verwijderd/mislukt)",
    "harvestables.column.enabled.true": "Ja",
    "harvestables.column.enabled.false": "Nee",
    "harvestables.column.jobClass.OaiPmhResource": "OAI-PMH",
    "harvestables.column.jobClass.XmlBulkResource": "XML-bulk",
    "harvestables.column.jobClass.HarvestConnectorResource": "Connector voor harvest",
    "harvestables.column.jobClass.StatusResource": "Rapport over status",
    "harvestables.column.currentStatus.NEW": "Nieuw",
    "harvestables.column.currentStatus.OK": "OK",
    "harvestables.column.currentStatus.WARN": "Waarschuwing",
    "harvestables.column.currentStatus.ERROR": "Fout",
    "harvestables.column.currentStatus.RUNNING": "Bezig",
    "harvestables.column.currentStatus.FINISHED": "Klaar",
    "harvestables.column.currentStatus.KILLED": "Afgebroken",
    "harvestables.index.name": "Naam",
    "harvestables.index.id": "ID",
    "harvestables.index.message": "Bericht",
    "searchInputLabel": "Lessen zoeken",
    "accordion.devinfo": "Informatie voor ontwikkelaars",
    "harvestables.heading.general": "Algemene informatie",
    "harvestables.field.id": "ID",
    "harvestables.field.id.help": "Automatisch toegewezen identificatiekenmerk voor de taak",
    "harvestables.field.name": "Naam",
    "harvestables.field.name.help": "Bij voorkeur een unieke naam voor gebruikers om deze harvesterbron te identificeren. In sommige gevallen kan de naam worden opgegeven na het invullen van een protocol-specifiek deel van de configuratie (bijv. Index Data Connectors, OAI-PMH).",
    "harvestables.field.serviceProvider": "Service provider",
    "harvestables.field.serviceProvider.help": "Vrije-tekstveld gebruikt door medewerkers voor het opnemen van administratieve informatie. Niet gebruikt door de harvester.",
    "harvestables.field.usedBy": "Gebruikt door",
    "harvestables.field.usedBy.help": "Vrije-tekstveld voor het taggen van een taak met de beoogde doelgroep, zoals een gebruikersgroep of klant van de bron. Meerdere tags voor gebruikers/klanten kunnen van elkaar gescheiden worden door komma's. De tags kunnen worden gebruikt voor het filteren van statusrapporten op gebruiken/klanten.",
    "harvestables.field.managedBy": "Beheerd door",
    "harvestables.field.managedBy.help": "Vrije-tekstveld voor het taggen van een taak met de leverancier of beheerder van de bron. Meerdere tags kunnen door komma's gescheiden worden. De tags kunnen worden gebruikt voor het filteren van statusrapporten door taakbeheerders.",
    "harvestables.field.openAccess": "Open-access-bron?",
    "harvestables.field.description": "Contentomschrijving",
    "harvestables.field.description.help": "Vrije-tekstveld gebruikt door medewerkers voor het opnemen van administratieve informatie. Niet gebruikt door de harvester.",
    "harvestables.field.technicalNotes": "Technische opmerking",
    "harvestables.field.technicalNotes.help": "Vrije-tekstveld gebruikt door medewerkers voor het opnemen van administratieve informatie. Niet gebruikt door de harvester.",
    "harvestables.field.contactNotes": "Opmerking over contacten",
    "harvestables.field.contactNotes.help": "Vrije-tekstveld gebruikt door medewerkers voor het opnemen van administratieve informatie. Niet gebruikt door de harvester.",
    "harvestables.field.enabled": "Harvesttaak ingeschakeld?",
    "harvestables.field.enabled.help": "Inchecken om de harvestingtaak uit te voeren zoals beschreven door de tijd/interval geselecteerd in \"Harvestschema\". Als u dit vakje niet aanvinkt, wordt de taak inactief.",
    "harvestables.field.scheduleString": "Harvestschema",
    "harvestables.field.scheduleString.help": "Gebruik deze velden om een terugkerende tijd/interval te definiëren waarop de harvestertaak moet worden uitgevoerd. Geef bijvoorbeeld voor wekelijkse runs een dag van de week op waarop de harvestertaak moet worden uitgevoerd.",
    "harvestables.field.scheduleString.harvest": "Harvest",
    "harvestables.field.scheduleString.day": "(dag) van",
    "harvestables.field.scheduleString.month": "(maand) als het",
    "harvestables.field.scheduleString.weekday": "(dag van de week)",
    "harvestables.field.scheduleString.time": "Harvestingstijd",
    "harvestables.field.scheduleString.hour": "(uur in 24-formaat)",
    "harvestables.field.scheduleString.minute": "(min.)",
    "harvestables.field.transformationPipeline": "Transformatie pijplijn",
    "harvestables.field.transformationPipeline.help": "Selecteer de transformatie die vereist is om het invoerformat dat door de feed wordt geleverd, af te stemmen op het interne format dat door de harvester wordt gebruikt voor gegevensopslag. Zie de sectie 'Transformatie pijplijnen handleiding' voor meer details.",
    "harvestables.field.laxParsing": "Gebruik lax parsing (indien mogelijk)",
    "harvestables.field.laxParsing.help": "Indien ingeschakeld, zal harvester proberen misvormde XML te parsen (Ontbrekende afsluitende tags, entiteiten)",
    "harvestables.field.encoding": "Codering overschrijven (ISO-8859-1, UTF-8, ...)",
    "harvestables.field.encoding.help": "Een feed kan ongeldig gecodeerde antwoorden terugsturen, zoals een XML-header met codering ingesteld op UTF-8, maar in werkelijkheid ISO-8859-1 terugsturen in de gegevens. Door dit veld op de werkelijke codering in te stellen, wordt de harvester gedwongen de opgegeven codering te gebruiken.",
    "harvestables.field.storage.name": "Opslag",
    "harvestables.field.storage.name.help": "Selecteer het opslagtype en de locatie voor degeharveste gegevens. De harvester heeft een opslagabstractielaag om met meerdere potentiële record opslagsystemen te kunnen werken, maar momenteel wordt alleen Solr/Lucene ondersteund. Zodra de opslag geselecteerd is, is het mogelijk om de geïndexeerde records te bekijken door op het veld Opgeslagen records: klik om te bekijken te klikken.",
    "harvestables.field.storageBatchLimit": "Limiet opslagbatch",
    "harvestables.field.cacheEnabled": "Cache op schijf?",
    "harvestables.field.cacheEnabled.help": "Als dit is ingeschakeld, worden de harvestgegevens in de cache van het bestandssysteem bewaard en kan de taak vanuit deze cache opnieuw worden gestart zonder dat het nodig is om terug naar de server te gaan.",
    "harvestables.field.storeOriginal": "Inhoud van originele record opslaan?",
    "harvestables.field.recordLimit": "Beperk het aantal records tot",
    "harvestables.field.recordLimit.help": "Beperk de harvest-run tot een opgegeven aantal records: handig voor het testen van taakinstellingen en transformatiepijplijnen.",
    "harvestables.field.timeout": "Time-out verbinding/lezen (seconden)",
    "harvestables.field.timeout.help": "Geef een niet-standaard time-outwaarde op voor het verkrijgen en lezen van de netwerkverbinding (socket). Waarden onder 1 minuut worden niet aanbevolen.",
    "harvestables.field.logLevel": "Logniveau",
    "harvestables.field.logLevel.help": "Geef het logniveau voor de taak op, waarbij DEBUG het meest uitgebreid is. INFO is in de meeste gevallen het aanbevolen logniveau.",
    "harvestables.field.failedRecordsLogging": "Opslaan van mislukte records",
    "harvestables.field.failedRecordsLogging.help": "Geef op of mislukte records al dan niet als XML-bestanden in een aangewezen logdirectory moeten worden opgeslagen. Geef ook het bewaarbeleid voor de map op, d.w.z. of bestanden die bij eerdere runs zijn opgeslagen, moeten worden bewaard en zo ja, of een bestaand bestand moet worden overschreven als dezelfde record opnieuw mislukt, of dat er een volgnummer aan de nieuwe bestandsnaam moet worden toegevoegd om niet te worden overschreven.",
    "harvestables.field.maxSavedFailedRecordsPerRun": "Maximum aantal mislukte records opgeslagen volgende run",
    "harvestables.field.maxSavedFailedRecordsPerRun.help": "Stelt een maximumaantal bestanden in om op te slaan in de map met mislukte records per run. De taaklog geeft aan wanneer de limiet is bereikt.",
    "harvestables.field.maxSavedFailedRecordsTotal": "Maximum aantal opgeslagen mislukte records totaal",
    "harvestables.field.maxSavedFailedRecordsTotal.help": "Stelt een maximumaantal bestanden in dat op een gegeven moment in de map met mislukte records moet worden opgeslagen - als de som van eerder opgeslagen records (die niet vóór deze run zijn opgeschoond) plus eventuele nieuwe records die tijdens de run zijn toegevoegd. De taaklog geeft aan wanneer de limiet is bereikt.",
    "harvestables.field.mailAddress": "E-mailadressen voor notificaties",
    "harvestables.field.mailAddresses": "E-mailadressen voor notificaties",
    "harvestables.field.mailAddresses.help": "Lijst met e-mailadressen die een notificatie moeten ontvangen bij het voltooien van een taak.",
    "harvestables.field.mailLevel": "Stuur een notificatie als de ernst minstens",
    "harvestables.field.mailLevel.help": "specificeer de status van voltooiing van de taak met de minste ernst die de e-mailnotificatie zal triggeren.",
    "harvestables.field.constantFields": "Lijst met constante velden",
    "harvestables.field.constantFields.help": "Een lijst met NAME=VALUE koppel. Voor een harvestable met dit veld ingesteld, heeft elkegeharveste record elk NAME-veld ingesteld op de corresponderende VALUE.",
    "harvestables.field.json": "Extra configuratie: (JSON)",
    "harvestables.field.json.help": "Specificeer extra geavanceerde configuratie voor harvester in de JSON-indeling.",
    "harvestables.field.type.oaiPmh": "Specifieke OAI-PMH informatie",
    "harvestables.field.url": "OAI archief-URL",
    "harvestables.field.url.help": "Voer een link in (http-gebaseerd) naar de bron die geharvest moet worden. Neem de basislink op die gedefinieerd is door OAI Set Name: (zie hieronder). Sommige bronnen hebben meerdere sets binnen het archief. Als de URL geen specifieke set aangeeft, wordt het volledige archief geharvest.",
    "harvestables.field.oaiSetName": "OAI Set Name (type voor suggesties)",
    "harvestables.field.oaiSetName.help": "een optionele instelling, een OAI-PMH setSpec-waarde die setcriteria voor selectief harvesten specificeert.",
    "harvestables.field.metadataPrefix": "Voorvoegsel metadata",
    "harvestables.field.metadataPrefix.help": "Een tekenreeks die het format van de metadata aangeeft in OAI-PMH aanvragen die naar een doelbewaarplaats gestuurd worden. Het is belangrijk om het juiste format te kiezen, anders worden er geen gegevens uit het archief geharvest. Zorg ervoor dat een transformatiepijplijn geselecteerd is die overeenkomt met het metadata format dat in de repository gebruikt wordt, anders zullen records niet begrepen worden door de harvester. Repositories gebruiken over het algemeen een van de volgende voorvoegsels (of ingesloten gegevensformaten): Dublin Core (OAI-DC) of MARC XML (MARC12/USMARC). Andere minder gebruikelijke MetadataPrefix waarden zijn PMC (PubMed Central full-text records), PMC (PubMed Central metadata records), en PZ2 (pazpar2).",
    "harvestables.field.dateFormat": "Datumformat",
    "harvestables.field.useLongDateFormat": "Lange datumnotatie gebruiken",
    "harvestables.field.useLongDateFormat.help": "Selectievakje om aan te geven of een lang datumformat gebruikt moet worden bij het aanvragen van records van de OAI-PMH bron. Dit wordt niet vaak gebruikt, maar wordt door sommige bronnen vereist.",
    "harvestables.field.fromDate": "Harvest van",
    "harvestables.field.fromDate.help": "Als dit veld leeg is en er geen hervattingstoken is ingesteld, zal de harvester de volledige gegevensset van de bron harvesten. Als dit veld een waarde bevat, zal de harvester na voltooiing van de taak de waarde van dit veld resetten naar de dag voorafgaand aan de Huidige rundatum, zodat volgende runs alleen nieuwe records zullen harvesten.",
    "harvestables.field.untilDate": "Harvest tot",
    "harvestables.field.untilDate.help": "Bovenste datumgrens voor selectief harvesten. Bij opeenvolgende runs zal de harvester dit veld wissen, waardoor het datuminterval voor onbepaalde tijd wordt.",
    "harvestables.field.resumptionToken": "Hervattingstoken (overschrijft datum)",
    "harvestables.field.resumptionToken.help": "Het OAI-PMH-protocol ondersteunt het opsplitsen van grotere datasets in kleinere brokken. Bij levering van een brok records retourneert OAI-PMH een token dat de volgende aanvraag moet gebruiken in bestelling van de volgende brok. Als een OAI-PMH taak stopt voordat deze voltooid is, wordt het hervattingstoken in dit veld gezet. Soms is het mogelijk om de taak later vanaf dit hervattingspunt opnieuw uit te voeren, maar dit wordt niet altijd ondersteund.",
    "harvestables.field.clearRtOnError": "Hervattingstoken wissen bij verbindingsfouten",
    "harvestables.field.clearRtOnError.help": "Wis het hervattingstoken voor harvesten die in een foutstatus worden voltooid. Dit is handig wanneer de server een foutmelding geeft en het laatste hervattingstoken niet meer geldig is.",
    "harvestables.field.keepPartial": "Gedeeltelijke harvests houden",
    "harvestables.field.keepPartial.help": "Indien aangevinkt, worden gedeeltelijke records die tijdens een mislukte harvest zijn geharvest, in de opslag bewaard.",
    "harvestables.field.retryCount": "Aantal nieuwe pogingen aanvragen",
    "harvestables.field.retryCount.help": "Geef aan hoe vaak de harvester mislukte aanvragen voor harvest opnieuw moet proberen, 0 schakelt opnieuw proberen volledig uit.",
    "harvestables.field.retryWait": "Vertraging voor opnieuw proberen (seconden)",
    "harvestables.field.retryWait.help": "Vertraging voor het opnieuw proberen van mislukte aanvragen. Alleen wijzigen als de bron niet werkt met de standaardwaarden.",
    "harvestables.field.type.xmlBulk": "XML-bulkspecifieke informatie",
    "harvestables.field.urls": "URL's",
    "harvestables.field.urls.help": "Een of meer door spaties gescheiden URL's (HTTP of FTP) voor binaire XML- of MARC-gegevens. Jump- of indexpagina's (HTML-pagina's met URL's) worden ondersteund, net als FTP-directories. Voor FTP kan harvesting van recursieve directories hieronder worden ingeschakeld.",
    "harvestables.field.allowErrors": "Verder met fouten?",
    "harvestables.field.allowErrors.help": "Verder om door te gaan met het harvesten en opslaan van records, zelfs als het ophalen van sommige van de vermelde bronnen mislukt.",
    "harvestables.field.overwrite": "Gegevens overschrijven bij elke run (niet-incrementeel)?",
    "harvestables.field.overwrite.help": "Inchecken om alle eerder geharveste gegevens te verwijderen voordat de volgende geplande (of handmatig getriggerde) run begint. Dit kan worden gebruikt wanneer complete catalogi op de server aanwezig zijn. Met FOLIO-collectiebezit is er geen verwijdering van alle eerder geharveste gegevens, en het aanvinken van deze optie geeft in plaats daarvan aan dat bestaande records moeten worden overlapt.",
    "harvestables.field.allowCondReq": "De server alleen om nieuwe bestanden vragen (incrementeel)?",
    "harvestables.field.allowCondReq.help": "Vraagt de server of de bestanden gewijzigd zijn voordat u probeert te harvesten, vertrouwt op de juiste tijdstempelverwerking aan de serverzijde. Het is meestal veilig om dit in te schakelen, omdat servers graag de wijzigingsdatum updaten, zelfs als de bestanden zelf niet zijn gewijzigd. Als u deze instelling inschakelt, kan dit de harvesttijd aanzienlijk verkorten.",
    "harvestables.field.initialFromDate": "Initiële ingangsdatum (indien incrementeel)",
    "harvestables.field.initialFromDate.help": "Hiermee kunt u de begindatum vanaf de harvestdatum opgeven wanneer de optie <strong>vraag server alleen om nieuwe bestanden</strong> is aangevinkt. Wanneer deze is ingevuld, worden alleen bestanden geharvest die nieuwer zijn dan de opgegeven datum. Met FOLIO-collectiebezit geeft de instelling bovendien aan dat alleen inkomende records die op of na deze datum zijn geüpdatet, moeten worden ingevoerd. Om dit effect te laten hebben, moeten de inkomende records een 'lastUpdated' opgeven in het element 'processing' en in het format YYYY-MM-DD &lt;processing&gt; &lt;lastUpdated&gt;1970-01-01&lt;/lastUpdated&gt; &lt;/processing&gt; Standaard zou de logica filteren op de einddatum van de laatste harvest, dus de instelling 'Initial from date' overschrijft het standaardgedrag. De volgende regels zijn dus van toepassing: <li>Als 'Gegevens overschrijven' is aangevinkt, worden alle records ingevoerd.</li> Anders: <li>Als de inkomende records een 'lastUpdated' datum hebben, en de 'Initial from date' is ingesteld, dan worden alleen records geladen die op of na die datum zijn bijgewerkt (dit is ongeacht of 'Ask server for new files only (incremental)' is aangevinkt of niet)</li> <li>Als de inkomende records een 'lastUpdated' datum hebben, en de 'Begindatum' NIET is ingesteld, worden alleen records geladen die op of na de laatste harvestdatum zijn bijgewerkt</li> Maar <li>Alle records zonder 'laatst bijgewerkt'-datum worden wel geladen</li>",
    "harvestables.field.splitAt": "XML splitsen op diepte (nul/leeg schakelt splitsen uit)",
    "harvestables.field.splitAt.help": "Voor XML-gegevens. Dit moet meestal op 1 worden ingesteld voor XML-feeds, als we de record-elementen willen harvesten in de gegevens die gestructureerd zijn als: &lt;root&gt; &nbsp;&lt;record/&gt; &nbsp;&lt;record/&gt; &lt;/root&gt;",
    "harvestables.field.splitSize": "Bestanden splitsen op aantal records (nul/leeg schakelt splitsen uit)",
    "harvestables.field.splitSize.help": "De harvester probeert waar mogelijk streaming parsing te impliceren, maar veel XSL-transformaties zullen dit niet ondersteunen. Het transformeren van miljoenen records zal te veel geheugen in beslag nemen, dus het opdelen van de bron in delen van 1000 records lijkt een redelijke optie. Voer in dit veld het aantal records in dat in elke deel moet zitten.",
    "harvestables.field.expectedSchema": "Mime-type overschrijven (bijv.: application/marc; charset=MARC-8)",
    "harvestables.field.expectedSchema.help": "De harvester detecteert het type (XML vs MARC binair) aan de hand van het MIME-type en de Bestandsextensie. Het kan ook omgaan met gecomprimeerde archieven (zip, tar, gzip), in sommige zeldzame gevallen kan het vereist zijn om het inhoudstype handmatig op te geven (bijv. als het Ontbrekend of verkeerd is), het format is:   MIME-type [; optionele tekencodering].",
    "harvestables.field.outputSchema": "MARC XML transformatieformaat (application/marc of application/tmarc)",
    "harvestables.field.outputSchema.help": "Dit veld geeft het uitvoerformaat van binair MARC lezen aan - wat ook het invoerformaat voor de transformatiepijplijn zal zijn. Als de Transformatie-pijplijn MARC21 XML verwacht, moet dit worden ingesteld op Application/marc. Als de pijplijn Turbo MARC XML verwacht, moet dit worden ingesteld op Application/tmarc.",
    "harvestables.field.recurse": "Terugkeren naar submappen?",
    "harvestables.field.recurse.help": "Indien ingesteld, doorloopt de harvester de hele mappenstructuur en zoekt naar bestanden die geharvest kunnen worden. Deze instelling moet voorzichtig worden ingeschakeld.",
    "harvestables.field.includeFilePattern": "Bestanden opnemen (reguliere expressie)",
    "harvestables.field.includeFilePattern.help": "Deze instelling kan gebruikt worden om te filteren welke bestanden geharvest moeten worden.  Het filter geldt zowel voor bestanden in FTP-directories als in archieven (ZIP/tar).  Indien ingesteld op een reguliere uitdrukking, zal de harvester alleen bestanden harvesten met namen die overeenkomen met de reguliere uitdrukking (tenzij de bestandsnaam tegelijkertijd wordt uitgesloten door een uitsluitingspatroon).   Voorbeeld:  <pre>.*\\.xml|.*\\.marc</pre> Sluit alleen .xml- en .marc-bestanden in.    Opmerking: puntjes in bestandsnamen moeten verdwijnen.    Opmerking: ZIP- en tar-bestanden (.zip,.gz,.tar) worden ook ingevoerd als ze niet in het include-patroon zijn gespecificeerd. Om uitsluiting van ZIP- of tar-bestanden af te dwingen, moeten ze worden opgegeven in een uitsluitingspatroon (zie de helptekst hiervoor).",
    "harvestables.field.excludeFilePattern": "Bestanden uitsluiten (reguliere uitdrukking)",
    "harvestables.field.excludeFilePattern.help": "Deze instelling kan gebruikt worden om te filteren welke bestanden geharvest moeten worden. Het filter is van toepassing op bestanden in FTP-directories en ook op vermeldingen in archieven (ZIP/tar).  Indien ingesteld op een reguliere uitdrukking, zal de harvester elk bestand overslaan met een bestandsnaam die overeenkomt met de uitdrukking. Voorbeeld: <pre>readme.txt|README|.*\\.jpg|.*\\.gif</pre> Zou bestanden met namen readme.txt, README en .jpg- en .gif-bestanden uit FTP-directories of ZIP/tar-archieven uitsluiten.",
    "harvestables.field.passiveMode": "Passieve modus gebruiken voor FTP-overschrijvingen?",
    "harvestables.field.passiveMode.help": "Als deze instelling is ingeschakeld, wordt de passieve in plaats van de actieve modus gebruikt voor FTP-verbindingen. Als harvester binnen een Beperkte firewall draait die verbindingen met de actieve modus van FTP blokkeert, kan het helpen om deze instelling in te schakelen. Het kan echter nodig zijn om deze modus af te stemmen op wat de FTP-server verwacht.",
    "harvestables.field.csvConfiguration": "CSV parser configuratie",
    "harvestables.field.csvConfiguration.help": "De harvester detecteert (op basis van MIME-type of bestandsextensie) CSV-bestanden (door komma's gescheiden waarden) en probeert deze te parsen naar een XML-weergave voor verdere verwerking. De XML-weergave van elke gegevensrij ziet er als volgt uit: <pre>&lt;row&gt;&lt;field name=&quot;column name or number&quot;&gt;field value&lt;/field&gt;...&lt;/row&gt;</pre> Tenzij de optie splitsen op diepte is ingesteld op > 0, worden alle rijen in een enkel XML-document geparseerd en omwikkeld met een extra &lt;rows&gt; root-element. Voor grote CSV-bestanden kan het een goed idee zijn om splitsen op diepte in te stellen op 1. De parserconfiguratie wordt uitgedrukt in een door puntkomma's gescheiden sleutel/waardenlijst, zoals: key1=waarde1; key2=waarde2. De lijst met ondersteunde opties is als volgt: <ul> <li> charset: standaard \"iso-8859-1\", specificeert de tekencodering van de bestanden</li> <li> delimiter: standaard \",\" voor CSV en \"xt\" voor TSV, specificeert het veldscheidingsteken dat in de bestanden wordt gebruikt</li> <li> containsHeader: standaard \"yes\", specificeert of de eerste regel in de bestanden de header-regel bevat</li> <li> headerLine: geen standaard, maakt het mogelijk headers te overschrijven of te specificeren, format is een door komma's gescheiden lijst e.g headers=\"title,author,description\"</li></ul>",
    "harvestables.field.type.connector": "Specifieke informatie over aansluitingen",
    "harvestables.field.connectorEngineUrlSetting.label": "CF Engine",
    "harvestables.field.connectorEngineUrlSetting.label.help": "Selecteer de instantie van de Connector Engine die zal worden gebruikt om de taak voor het harvesten van de Connector uit te voeren. De standaard engine wordt gehost door Index Data, maar kan ook lokaal op de klantlocatie worden geïnstalleerd. Extra Connector-engines kunnen worden opgegeven via het tabblad Instellingen.",
    "harvestables.field.engineParameters": "Engine parameters (optioneel)",
    "harvestables.field.engineParameters.help": "Aanvullende of aangepaste waarden van Connector Engine sessieparameters die door deze taak worden gebruikt. Zie de CFWS manpagina voor meer informatie.",
    "harvestables.field.connectorRepoUrlSetting.label": "CF opslagplaats",
    "harvestables.field.connectorRepoUrlSetting.label.help": "Selecteer de Connector Repository waar de Connectors worden gehost en onderhouden. Meestal wordt de Connector Repository geleverd door Index Data en kan een login account nodig zijn. De accountgegevens worden rechtstreeks verstrekt in de URL-instelling van de Connector Repository, die u kunt openen vanaf het tabblad Instellingen, en moeten de volgende vorm hebben: <pre>http(s)://&lt;repouser&gt;:&lt;repopass&gt;@url.to.the.repository</pre>.",
    "harvestables.field.connector": "Aansluiting (type voor suggestie)",
    "harvestables.field.connector.help": "Voer hier de naam in van de harvesting-connector die specifiek is voor de geharveste bron. Dit veld geeft suggesties door de Repository op te zoeken, dus slechts een paar beginletters of een deel van de naam is vereist.",
    "harvestables.field.overwrite-connector.help": "Inchecken om alle eerder geharveste gegevens te verwijderen voordat de volgende geplande (of handmatig getriggerde) run wordt gestart.",
    "harvestables.field.connuser": "Gebruikersnaam",
    "harvestables.field.connuser.help": "Vereiste gebruikersnaam voor toegang tot een harvest bron waarvoor verificatie vereist is.",
    "harvestables.field.password": "Wachtwoord",
    "harvestables.field.password.help": "Vereist wachtwoord voor toegang tot een geharveste bron waarvoor verificatie vereist is.",
    "harvestables.field.proxy": "Adres Proxy-server",
    "harvestables.field.proxy.help": "Adres van de proxyserver die door de harvester moet worden gebruikt, bijvoorbeeld voor gevallen waarin de bron IP-geauthenticeerd is.",
    "harvestables.field.initData": "Init-gegevens",
    "harvestables.field.initData.help": "Geavanceerde instelling om extra initialisatieparameters aan de harvesting-connector te geven. Alle gebruikersnamen/wachtwoorden/proxy's die in de bovenstaande ingangen zijn opgegeven, hebben voorrang op de instellingen die in dit veld zijn opgegeven. Deze instellingen moeten in JSON-format worden aangeleverd.",
    "harvestables.field.startToken": "Starttoken (incrementele harvest)",
    "harvestables.field.startToken.help": "Het gebruik van een starttoken voor incrementeel harvesten is connector-specifiek en hangt af van de mogelijkheden van de connector. Deze instelling moet in JSON-format worden aangeleverd.",
    "harvestables.field.sleep": "Vertraging tussen aanvragen (milliseconden)",
    "harvestables.field.sleep.help": "Vertraging tussen aanvragen van de harvester aan de connector-engine. Gebruik dit als de bron gevoelig is voor hoge invoer.",
    "harvestables.field.failedRetryCount": "Aantal mislukte aanvragen dat opnieuw wordt geprobeerd",
    "harvestables.field.failedRetryCount.help": "Geef aan hoe vaak de harvester mislukte aanvragen voor harvest opnieuw moet proberen, 0 schakelt opnieuw proberen volledig uit.",
    "harvestables.field.type.status": "Algemene informatie",
    "harvestables.field.usageTags": "Filter: lijst met gebruik tags",
    "harvestables.field.usageTags.help": "Wordt gebruikt om het rapport over de status te filteren op gebruikersgroepen van klanten die aan een harvest taak zijn gekoppeld (\"Gebruikt door\").",
    "harvestables.field.adminTags": "Filter: lijst met beheertags",
    "harvestables.field.adminTags.help": "Wordt gebruikt voor het filteren van het status rapport door de maker of beheerder van de harvestables, zoals getagd aan de harvest job (\"Beheerd door\")",
    "harvestables.field.statusJobEnabled": "Status taak ingeschakeld",
    "harvestables.field.customMailAddresses": "Maatwerk e-mailadressen (meerdere gescheiden met komma)",
    "harvestables.heading.status": "Statusinformatie",
    "harvestables.field.currentStatus": "Huidige status:",
    "harvestables.field.initiallyHarvested": "Eerste harvest",
    "harvestables.field.lastHarvestStarted": "Laatste harvest begonnen",
    "harvestables.field.lastHarvestFinished": "Laatste harvest voltooid",
    "harvestables.field.lastUpdated": "Laatst bijgewerkt",
    "harvestables.field.message": "Bericht van de laatste harvest:",
    "harvestables.field.failedRecordsLogging.NO_STORE": "Mislukte records niet opslaan",
    "harvestables.field.failedRecordsLogging.CLEAN_DIRECTORY": "Opslaan. Directory eerst opschonen",
    "harvestables.field.failedRecordsLogging.CREATE_OVERWRITE": "Opslaan. Bestaande bestanden overschrijven",
    "harvestables.field.failedRecordsLogging.ADD_ALL": "Opslaan. Genummerde versies toevoegen voor bestaande bestanden",
    "SENTINEL": "SENTINEL",
    "harvestables.field.jobClass": "Taak",
    "harvestables.field.jobClass.oaiPmh": "OAI-PMH",
    "harvestables.field.jobClass.xmlBulk": "XML-bulk",
    "harvestables.field.jobClass.connector": "Connector voor harvest",
    "harvestables.field.jobClass.status": "Rapport over status",
    "harvestables.column.currentStatus.SHUTDOWN": "Afsluiten",
    "button.view-log": "Logboek bekijken",
    "summary-table.summary": "Overzicht",
    "summary-table.instances": "Instance",
    "summary-table.holdings": "Holdings",
    "summary-table.items": "Item",
    "summary-label.processed": "Verwerkt",
    "summary-label.loaded": "Geladen",
    "summary-label.deleted": "Verwijderd",
    "summary-label.failed": "Mislukt",
    "failed-records.recordNumber": "Recordnummer",
    "failed-records.timeStamp": "Tijdstempel",
    "failed-records.instanceHrid": "Instance-HRID",
    "failed-records.instanceTitle": "Instance titel",
    "failed-records.errors": "Fouten",
    "harvestables.column.logFile": "Logbestand",
    "harvestables.column.records": "Records",
    "logs.countFailedRecords": "{count, number} {count, plural, one {failed record} other {failed records}}",
    "stats.instances": "Instances",
    "stats.holdings": "Holdings",
    "stats.items": "Items",
    "nav.jobs": "Taken",
    "nav.jobs-for": "Taak voor {name}",
    "button.old-jobs": "Oude taken",
    "logs.plainTextLog.running": "Live logboek in platte tekst voor huidige taak",
    "logs.plainTextLog.previous": "Logboek in platte tekst voor laatste taak",
    "logs.plainTextLog.refresh": "Vernieuwen",
    "settings.storage": "Storage engines",
    "settings.pipeline": "Transformatie pijplijnen",
    "settings.step": "Stappen voor transformatie",
    "permission.all": "Harvester admin: Alle rechten",
    "filter.date.started": "Datum gestart",
    "filter.date.started.from": "Van",
    "filter.date.started.to": "Tot",
    "filter.date.finished": "Datum voltooid",
    "filter.date.finished.from": "Van",
    "filter.date.finished.to": "Tot",
    "error.invalidSort.label": "Ongeldig sorteercriterium",
    "error.invalidSort.content": "Het is niet mogelijk om te sorteren op de <code>{name}</code> kolom vanwege implementatiebeperkingen.",
    "jobs.index.name": "Naam harvester",
    "jobs.index.id": "ID",
    "jobs.index.harvestableId": "Harvester-ID",
    "jobs.index.message": "Bericht",
    "jobs.index.all": "(Alle)",
    "jobs.column.name": "Naam harvester",
    "jobs.column.status": "Status",
    "jobs.column.amountHarvested": "Records",
    "jobs.column.seconds": "Seconden",
    "jobs.column.started": "Gestart",
    "jobs.column.finished": "Afgerond",
    "jobs.column.type": "Taak",
    "jobs.column.message": "Bericht (verwerkt/geladen/verwijderd/fout)",
    "nav.records": "Mislukte records",
    "records.index.recordNumber": "Recordnummer",
    "records.index.instanceHrid": "Instance-hrid",
    "records.index.instanceTitle": "Instance titel",
    "records.index.errors": "Fouten",
    "records.index.timeStamp": "Tijdstempel",
    "records.index.harvestableName": "Naam harvester",
    "records.index.all": "(Alle)",
    "filter.date.timeStamp": "Tijdstempel",
    "filter.date.timeStamp.from": "Van",
    "filter.date.timeStamp.to": "Tot",
    "failed-records.harvestableName": "Naam harvester",
    "button.view-log.current": "Huidige logboek",
    "button.view-log.last": "Laatste logboek",
    "harvestables.column.oldJobs": "Oude functies",
    "selectValue": "Selecteer een waarde",
    "fillIn": "Vul dit in om verder te gaan",
    "selectToContinue": "Selecteren om verder te gaan",
    "filter.numeric.records": "Records",
    "filter.numeric.records.from": "Ten minste",
    "filter.numeric.records.to": "Niet meer dan",
    "settings.storage.heading": "Opslagsystemen beheren",
    "settings.pipeline.heading": "Transformatie pijplijnen beheren",
    "settings.step.heading": "Transformatiestappen beheren",
    "storage.field.name": "Naam",
    "storage.field.description": "Omschrijving",
    "storage.field.enabled": "Ingeschakeld",
    "storage.field.url": "URL",
    "storage.field.json": "JSON-configuratie",
    "storage.field.type": "Soort opslag:",
    "invalidJSON": "Ongeldige JSON: {error}",
    "op.run.error": "Taak <b>{name}</b> kon niet worden gestart: {error}",
    "op.stop.error": "Taak <b>{name}</b> kon niet worden gestopt: {error}",
    "logs.plainTextLog.download": "Downloaden",
    "pipeline.field.name": "Naam",
    "pipeline.field.description": "Omschrijving",
    "pipeline.field.enabled": "Ingeschakeld",
    "pipeline.field.parallel": "Parallel",
    "pipeline.field.stepAssociations": "Stappen voor transformatie",
    "pipeline.steps.position": "#",
    "pipeline.steps.name": "Naam",
    "pipeline.steps.in": "In",
    "pipeline.steps.out": "Uit",
    "pipeline.steps.actions": "Acties",
    "step.field.name": "Naam",
    "step.field.description": "Omschrijving",
    "step.field.enabled": "Ingeschakeld (Dit wordt niet gebruikt)",
    "step.field.type": "Soort",
    "step.field.inputFormat": "Invoerformat",
    "step.field.outputFormat": "Uitvoerformat",
    "step.field.script": "Script",
    "step.field.testData": "Testgegevens",
    "step.field.testOutput": "Testuitgang",
    "step.field.customClass": "Maatwerk",
    "harvestables.field.statusJobEnabled.help": "",
    "harvestables.field.customMailAddresses.help": "",
    "set-to-xml2json": "Kies XML-naar-JSON",
    "export-csv": "CSV exporteren",
    "invalidXML": "Ongeldige XML: {error}",
    "invalidXSLT": "Geldige XML, maar geen XSLT-stylesheet",
    "validXSLT": "Geldig XSLT-stylesheet",
    "reports": "Rapporten",
    "transform": "Transformatie",
    "nav.mike": "Mike",
    "permission.settings.view": "Harvester admin (Settings): View storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit": "Harvester admin (Settings): View, edit storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit-create": "Harvester admin (Settings): View, edit, create storage engines, transformation pipelines and transformation steps",
    "permission.settings.view-edit-create-delete": "Harvester admin (Settings): View, edit, create, delete storage engines, transformation pipelines and transformation steps",
    "permission.harvestables.view": "Harvester admin: View harvestables",
    "permission.harvestables.view-edit": "Harvester admin: View, edit harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create": "Harvester admin: View, edit, create harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create-delete": "Harvester admin: View, edit, create, delete harvestables, start/stop jobs",
    "permission.jobs-and-failed-records.view": "Harvester admin: View jobs and failed records"
}