{
    "meta.title": "Administrador do Harvester",
    "no-value": "-",
    "error": "Algo deu errado",
    "resultCount": "{count, number} {count, plural, one { registro encontrado } other { registros encontrados }}",
    "add": "Adicionar",
    "actions.new": "Novo registro",
    "actions.new.harvestable.oaiPmh": "OAI-PMH coletável",
    "actions.new.harvestable.xmlBulk": "XML em lote coletável",
    "actions.new.harvestable.connector": "Conector de coleta",
    "actions.new.harvestable.status": "Relatório de status coletável",
    "nav.harvestables": "Trabalhos de coleta",
    "button.edit": "Editar",
    "button.delete": "Excluir",
    "button.start-job": "Iniciar trabalho",
    "button.stop-job": "Parar trabalho",
    "button.confirm": "Confirmar",
    "op.delete.confirm": "Tem certeza de que deseja excluir este registro?",
    "op.delete.completed": "Registro <b> {name} </b> excluído",
    "op.run.completed": "Trabalho <b> {name} </b> iniciado",
    "op.stop.completed": "Trabalho <b> {name} </b> interrompido",
    "harvestables.column.name": "Nome",
    "harvestables.column.currentStatus": "Status",
    "harvestables.column.lastHarvestFinished": "Última coleta concluída",
    "harvestables.column.enabled": "Habilitado?",
    "harvestables.column.jobClass": "Classe de trabalho",
    "harvestables.column.id": "ID",
    "harvestables.column.message": "Mensagem (processada/carregada/excluída (ignorada)/falhou)",
    "harvestables.column.enabled.true": "Sim",
    "harvestables.column.enabled.false": "Não",
    "harvestables.column.jobClass.OaiPmhResource": "OAI-PMH",
    "harvestables.column.jobClass.XmlBulkResource": "XML em lote",
    "harvestables.column.jobClass.HarvestConnectorResource": "Conector de coleta (harvesting)",
    "harvestables.column.jobClass.StatusResource": "Relatório de status",
    "harvestables.column.currentStatus.NEW": "Novo",
    "harvestables.column.currentStatus.OK": "OK",
    "harvestables.column.currentStatus.WARN": "Aviso",
    "harvestables.column.currentStatus.ERROR": "Erro",
    "harvestables.column.currentStatus.RUNNING": "Executando",
    "harvestables.column.currentStatus.FINISHED": "Concluído",
    "harvestables.column.currentStatus.KILLED": "Morto",
    "harvestables.index.name": "Nome",
    "harvestables.index.id": "ID",
    "harvestables.index.message": "Mensagem",
    "searchInputLabel": "Buscar por etiquetas (tags)",
    "accordion.devinfo": "Informações de desenvolvedore",
    "harvestables.heading.general": "Informação geral",
    "harvestables.field.id": "Id",
    "harvestables.field.id.help": "Identificador automaticamente atribuído para o trabalho",
    "harvestables.field.name": "Nome",
    "harvestables.field.name.help": "De preferência, um nome único para os usuários identificarem este recurso de coleta (harvester). Em alguns casos, o nome pode ser proposto após preencher a seção específica do protocolo da configuração (por exemplo, Index Data Connectors, OAI-PMH).",
    "harvestables.field.serviceProvider": "Provedor de serviço",
    "harvestables.field.serviceProvider.help": "Campo de texto livre utilizado pelo pessoal de apoio para registro de informações administrativas. Não utilizado pelo programa de coleta.",
    "harvestables.field.usedBy": "Usado por",
    "harvestables.field.usedBy.help": "Campo de texto livre para marcação de um trabalho com o público-alvo pretendido, como um grupo de usuários ou cliente do recurso. As tags de múltiplos usuários/clientes podem ser separadas por vírgulas. As tags podem ser usadas para filtrar relatórios de status por usuários/clientes.",
    "harvestables.field.managedBy": "Gerenciado por",
    "harvestables.field.managedBy.help": "Campo de texto livre para marcação de um trabalho com o produtor ou gerente do recurso. As etiquetas múltiplas podem ser separadas por vírgulas. As etiquetas podem ser usadas para filtrar relatórios de status pelos administradores do trabalho.",
    "harvestables.field.openAccess": "Recurso de acesso aberto?",
    "harvestables.field.description": "Descrição do conteúdo",
    "harvestables.field.description.help": "Campo de texto livre utilizado pelo pessoal de apoio para registro de informações administrativas. Não utilizado pelo programa de coleta (harvester).",
    "harvestables.field.technicalNotes": "Notas técnicas",
    "harvestables.field.technicalNotes.help": "Campo de texto livre utilizado pelo pessoal de apoio para registro de informações administrativas. Não utilizado pelo programa de coleta (harvester).",
    "harvestables.field.contactNotes": "Notas de contato",
    "harvestables.field.contactNotes.help": "Campo de texto livre utilizado pelo pessoal de apoio para registro de informações administrativas. Não utilizado pelo programa de coleta.",
    "harvestables.field.enabled": "Trabalho de coleta ativado?",
    "harvestables.field.enabled.help": "Marque esta opção para executar o trabalho de coleta conforme descrito pelo tempo/intervalo selecionado em \"Cronograma de coleta\". Deixar esta caixa desmarcada tornará o trabalho inativo.",
    "harvestables.field.scheduleString": "Cronograma de coleta",
    "harvestables.field.scheduleString.help": "Use estes campos para definir um tempo/intervalo recorrente no qual o trabalho do programa de coleta (harvester) deve ser executado. Por exemplo, para os trabalhos semanais, especificar um dia da semana em que a coleta deve ser executada.",
    "harvestables.field.scheduleString.harvest": "Coleta",
    "harvestables.field.scheduleString.day": "(dia) de",
    "harvestables.field.scheduleString.month": "(mês) se for",
    "harvestables.field.scheduleString.weekday": "(dia da semana)",
    "harvestables.field.scheduleString.time": "Tempo de coleta",
    "harvestables.field.scheduleString.hour": "(hora no formato 24)",
    "harvestables.field.scheduleString.minute": "(min)",
    "harvestables.field.transformationPipeline": "Fluxos de transformação",
    "harvestables.field.transformationPipeline.help": "Selecione a transformação necessária para adequar o formato de entrada fornecido pela alimentação ao formato interno utilizado pelo programa de coleta (harvester) para o armazenamento de dados. Consulte a seção do manual de Fluxos de Transformação para obter mais detalhes.",
    "harvestables.field.laxParsing": "Usar LAX PARSING (se possível)",
    "harvestables.field.laxParsing.help": "Quando habilitado, o programa de coleta (harvester) tentará analisar o XML malformado (marcas de fechamento ausentes, entidades)",
    "harvestables.field.encoding": "Sobrescrever codificação (ISO-8859-1, UTF-8, ...)",
    "harvestables.field.encoding.help": "Um feed pode retornar respostas codificadas inválidas, como ter um cabeçalho XML com codificação definida para UTF-8, mas na verdade retornar ISO-8859-1 nos dados. A definição deste campo para a codificação real forçará o programa de coleta (harvester) a usar a codificação que seja especificada.",
    "harvestables.field.storage.name": "Armazenamento",
    "harvestables.field.storage.name.help": "Selecione o tipo de armazenamento e o local para os dados coletados. O programa de coleta (harvester) tem uma camada de abstração de armazenamento para permitir que ele trabalhe com múltiplos sistemas potenciais de armazenamento de registros, mas atualmente, apenas Solr/Lucene é suportado. Uma vez selecionado o Armazenamento, é possível visualizar os registros indexados clicando no campo Armazenamento de registros: clique para visualizar o campo.",
    "harvestables.field.storageBatchLimit": "Limite do lote de armazenamento",
    "harvestables.field.cacheEnabled": "FAzer cache em disco?",
    "harvestables.field.cacheEnabled.help": "Se ativado, os dados de coleta serão mantidos no cache do sistema de arquivos e o trabalho pode ser reiniciado a partir deste cache sem precisar voltar para o servidor.",
    "harvestables.field.storeOriginal": "Armazenar o conteúdo original do registro?",
    "harvestables.field.recordLimit": "Limitar o número de registro a",
    "harvestables.field.recordLimit.help": "Limitar a execução da coleta a um número especificado de registros: útil para testar as configurações do trabalho e os fluxos de transformação.",
    "harvestables.field.timeout": "Tempo limite de conexão/leitura (segundos)",
    "harvestables.field.timeout.help": "Especifique um valor de tempo limite não padrão para obter e ler da conexão de rede (soquete). Valores abaixo de 1 minuto não são recomendados.",
    "harvestables.field.logLevel": "Nível de log",
    "harvestables.field.logLevel.help": "Especifique o nível de registro de log para o trabalho, sendo DEBUG o que mostra mais detalhes. INFO é o nível de registro de log recomendado na maioria dos casos.",
    "harvestables.field.failedRecordsLogging": "Salvando registros de falhas",
    "harvestables.field.failedRecordsLogging.help": "Especifique se os registros com falhas devem ou não ser salvos como arquivos XML em um diretório de log designado. Especifique também a política de retenção do diretório, ou seja, se deve reter arquivos que foram salvos em execuções anteriores e, se for o caso, se deve sobrescrever um arquivo existente se o mesmo registro falhar novamente ou se deve adicionar um número seqüencial ao novo nome do arquivo para não sobrescrever.",
    "harvestables.field.maxSavedFailedRecordsPerRun": "Número máximo de registros com falha salvos na próxima execução",
    "harvestables.field.maxSavedFailedRecordsPerRun.help": "Define um número máximo de arquivos a serem salvos no diretório de registros com falha por execução. O log de trabalho informará quando o limite for atingido.",
    "harvestables.field.maxSavedFailedRecordsTotal": "Número máximo de registros de falhas salvas no total",
    "harvestables.field.maxSavedFailedRecordsTotal.help": "Define um número máximo de arquivos a serem salvos no diretório de registros com falha a qualquer momento - como a soma de registros previamente salvos (que não foram limpos antes desta execução) além de quaisquer novos registros adicionados durante a execução. O registro de trabalho dirá quando o limite é atingido.",
    "harvestables.field.mailAddress": "Endereço(s) de e-mail de notificação (separados por vírgula)",
    "harvestables.field.mailAddresses": "Endereços de e-mail de notificação",
    "harvestables.field.mailAddresses.help": "Lista de endereços de e-mail que devem receber notificação na conclusão do trabalho.",
    "harvestables.field.mailLevel": "Enviar notificação se a gravidade for pelo menos",
    "harvestables.field.mailLevel.help": "especificar o status de conclusão do trabalho com o mínimo de severidade que acionará a notificação por e-mail.",
    "harvestables.field.constantFields": "Lista de campos constantes",
    "harvestables.field.constantFields.help": "Uma lista de pares NOME=VALOR. Para uma plataforma de coleta que tenha este campo definido, cada registro de coleta tem cada campo NOME definido para o VALOR correspondente.",
    "harvestables.field.json": "Configuração extra: (JSON)",
    "harvestables.field.json.help": "Especificar configuração avançada adicional do programa de coleta no formato JSON.",
    "harvestables.field.type.oaiPmh": "Informações específicas do OAI-PMH",
    "harvestables.field.url": "URL do repositório OAI",
    "harvestables.field.url.help": "Digite um link (baseado em http) no recurso a ser coletado. Inclua o link base definido pelo Nome do Conjunto OAI: (veja abaixo). Alguns recursos têm vários conjuntos dentro do repositório. Se nenhum conjunto específico for identificado pela URL, o repositório COMPLETO será coletado.",
    "harvestables.field.oaiSetName": "Nome do conjunto OAI (digite para obter sugestões)",
    "harvestables.field.oaiSetName.help": "uma configuração opcional, um valor OAI-PMH setSpec que especifica os critérios estabelecidos para a coleta seletiva.",
    "harvestables.field.metadataPrefix": "Prefixo de metadados",
    "harvestables.field.metadataPrefix.help": "Uma string que especifica o formato dos metadados nas solicitações OAI-PMH emitidos para um repositório específico. É importante escolher o formato correto ou nenhum dado será coletado do repositório. Certifique-se de selecionar um Fluxos de Transformação que corresponda ao formato de metadados usado no repositório, caso contrário, os registros não serão compreendidos pelo programa de coleta (harvester). Os repositórios geralmente usam um dos seguintes prefixos (ou formatos de dados incorporados): Dublin Core (OAI-DC) ou MARC XML (MARC12/USMARC). Outros valores menos comuns do MetadataPrefix incluem PMC (PubMed Central fulltext records), PMC (PubMed Central metadata records), e PZ2 (pazpar2).",
    "harvestables.field.dateFormat": "Formato de data",
    "harvestables.field.useLongDateFormat": "Usar formato de data longo",
    "harvestables.field.useLongDateFormat.help": "Caixa de seleção para indicar se deve ser usado um formato de data longa ao solicitar registros do recurso OAI-PMH. Isto não é usado com muita freqüência, mas é exigido por alguns recursos.",
    "harvestables.field.fromDate": "Coletar desde (aaaa-MM-dd)",
    "harvestables.field.fromDate.help": "Se estiver vazio e não houver nenhum token de reinício, o programa de coleta irá coletar o conjunto completo de dados do recurso. Quando este campo contiver um valor, após a conclusão do trabalho, o programa de coleta irá redefinir o valor deste campo para o dia anterior à data de execução atual, de modo que as execuções subseqüentes só coletarão novos registros.",
    "harvestables.field.untilDate": "Fazer coleta até (aaaa-MM-dd)",
    "harvestables.field.untilDate.help": "Data limite máxima para a coleta seletiva. Em execuções consecutivas, o programa de coleta (harvester) limpará este campo tornando o intervalo de datas em aberto.",
    "harvestables.field.resumptionToken": "Token de retomada (substitui a data)",
    "harvestables.field.resumptionToken.help": "O protocolo OAI-PMH suporta a divisão de conjuntos de dados maiores em pedaços menores. Na entrega de uma parte dos dados, o OAI-PMH devolve um token que o próximo pedido deve usar para obter a parte seguinte. Se um trabalho do OAI-PMH for interrompido antes da conclusão, o token de reinício será definido neste campo. Às vezes é possível executá-lo novamente a partir deste ponto de recomeço em uma etapa posterior, mas isto nem sempre é suportado.",
    "harvestables.field.clearRtOnError": "Limpar token de retomada em erros de conexão",
    "harvestables.field.clearRtOnError.help": "Limpe o token de retomada para coletas que terminam em algum status de erro. Isso é útil quando o servidor erra e o último token de retomada não é mais válido.",
    "harvestables.field.keepPartial": "Manter coletas parciais",
    "harvestables.field.keepPartial.help": "Quando selecionado, os registros parciais coletados durante uma coleta fracassada serão retidos no armazenamento.",
    "harvestables.field.retryCount": "Solicitar a contagem de repetições",
    "harvestables.field.retryCount.help": "Especifique quantas vezes o programa de coleta deve tentar novamente solicitações de coleta com falha, 0 (zero) desativa totalmente a tentativa.",
    "harvestables.field.retryWait": "Atraso antes de tentar novamente (segundos)",
    "harvestables.field.retryWait.help": "Atraso para tentar novamente pedidos com falha. Só muda quando o recurso não funciona com os valores padrão.",
    "harvestables.field.type.xmlBulk": "Informações específicas do lote XML",
    "harvestables.field.urls": "URLs (separados por espaços)",
    "harvestables.field.urls.help": "Uma ou mais URL separadas por espaço (HTTP ou FTP) para dados XML ou MARC binários. As páginas de salto ou índice (páginas HTML com URLs) são suportadas, assim como os diretórios FTP. Para ftp, a coleta a partir de diretórios recursivos pode ser habilitada abaixo.",
    "harvestables.field.allowErrors": "Continuar se ocorrerem erros?",
    "harvestables.field.allowErrors.help": "Marque esta opção para continuar coletando e armazenando registros mesmo se a recuperação de alguns dos recursos listados falhar.",
    "harvestables.field.overwrite": "Sobrescrever dados a cada execução (não incremental)?",
    "harvestables.field.overwrite.help": "Marque essa opção para EXCLUIR todos os dados previamente coletados antes de iniciar a próxima execução programada (ou acionada manualmente). Isto pode ser usado quando as lixeiras do catálogo completo residem no servidor.  Com o FOLIO Inventory Storage não há exclusão de todos os dados coletados anteriormente, e marcar esta opção indica, ao invés disso, que os registros existentes devem ser sobrepostos.",
    "harvestables.field.allowCondReq": "Solicitar ao servidor apenas novos arquivos (incremental)?",
    "harvestables.field.allowCondReq.help": "Pergunte ao servidor se os arquivos são modificados antes de tentar uma colheita, confie no manuseio adequado do carimbo de data/hora no lado do servidor. Geralmente é seguro ter isto habilitado, pois os servidores estão ansiosos para atualizar a data de modificação, mesmo nos casos em que os arquivos em si não mudam. A ativação desta configuração pode reduzir significativamente os tempos de coleta.",
    "harvestables.field.initialFromDate": "Data inicial \"desde\" (se incremental, aaaaa-MM-dd)",
    "harvestables.field.initialFromDate.help": "Permite especificar a data inicial da colheita (harvest) quando a opção <strong> solicitar ao servidor apenas novos arquivos </strong> estiver marcada. Quando preenchido, apenas os arquivos mais recentes que a data especificada serão coletados. Com o FOLIO Inventory Storage, a configuração indica adicionalmente que somente os registros de entrada que foram atualizados nessa data ou após essa data devem ser carregados. Além disso, para que isso tenha efeito, os registros de entrada devem fornecer uma data  'última atualização' no elemento 'em processamento' e no formato AAAA-MM-DD &lt;processing&gt; &lt;lastUpdated&gt; 01-01-1970 &lt;/lastUpdated&gt; &lt;/processing&gt; Por padrão, a lógica filtraria pela data de término da última colheita, portanto, definir 'Data inicial' substitui o comportamento padrão. As seguintes regras se aplicam: <li> Se 'Substituir dados' estiver marcado, todos os registros serão carregados. </li> Caso contrário: <li> Se os registros de entrada fornecerem uma data 'última atualização' e a 'Data inicial de' estiver definida, somente os registros atualizados nessa data ou após essa data serão carregados (isso independentemente de 'Perguntar servidor apenas para novos arquivos (incremental)' está marcado ou não) </li> <li> Se os registros de entrada fornecerem uma data de 'última atualização' e a 'Data inicial de' NÃO estiver definida, somente os registros atualizados em ou após a última data de colheita será carregada </li> Mas <li> Qualquer registro sem uma data 'última atualização' será carregado </li>",
    "harvestables.field.splitAt": "XML dividido em profundidade (0 zero/vazio desativa divisão)",
    "harvestables.field.splitAt.help": "Para dados XML. Isso geralmente deve ser definido como 1 para feeds XML, se quisermos coletar os elementos de registro nos dados estruturados como: &lt;root&gt; &nbsp;&lt;record/&gt; &nbsp;&lt;record/&gt; &lt;/root&gt;",
    "harvestables.field.splitSize": "Dividir arquivos em número de registros (0 zero/vazio desabilita a divisão)",
    "harvestables.field.splitSize.help": "O programa de coleta (harvester) tenta supor a análise de streaming sempre que possível, mas muitas Transformações XSL não suportarão isto. A tentativa de transformar milhões de registros consumirá memória RAM, portanto quebrar o recurso em partes de 1000 registros parece ser uma opção razoável. Insira neste campo o número de registros a serem contidos em cada parte.",
    "harvestables.field.expectedSchema": "Sobreposição do tipo MIME  (por exemplo: application/marc; charset=MARC-8)",
    "harvestables.field.expectedSchema.help": "O programa de coleta (Harvester) detecta o tipo ( XML vs MARC binário) a partir do tipo MIME e extensão do arquivo. Ele também é capaz de lidar com arquivos comprimidos (zip, tar, gzip), em alguns casos raros pode ser necessário fornecer o tipo de conteúdo manualmente (por exemplo, se estiver faltando ou errado), o formato é:   tipo MIME [; codificação de caracteres opcional].",
    "harvestables.field.outputSchema": "Formato de transformação MARC XML (application/marc OU application/tmarc)",
    "harvestables.field.outputSchema.help": "Este campo expressa o formato de saída da leitura de MARC binário - que também será o formato de entrada para o fluxo de transformação. Se o fluxo de transformação espera receber MARC21 XML, este deve ser definido como \"Application/marc\". Mas se o fluxo espera receber Turbo MARC XML, este deve ser definido como \"Application/tmarc\".",
    "harvestables.field.recurse": "Leitura recursiva em subpastas?",
    "harvestables.field.recurse.help": "Quando definido, o programa de coleta (harvester) percorrerá toda a árvore de diretórios e procurará os arquivos que podem ser coletados. Esta configuração deve ser habilitada com cuidado.",
    "harvestables.field.includeFilePattern": "Incluir arquivos (expressão regular)",
    "harvestables.field.includeFilePattern.help": "Esta configuração pode ser usada para filtrar que arquivos a coletar.  O filtro se aplica a arquivos em diretórios FTP, bem como em arquivos (ZIP/tar).  Quando configurado para uma expressão regular, o colhedor só coleta arquivos com nomes correspondentes à expressão regular (a menos que o nome do arquivo seja ao mesmo tempo excluído por um padrão de exclusão).   Exemplo: . <pre>*\\.xml|.*\\.marc</pre> Incluiria apenas arquivos .xml e .marc.  Note que os pontos do nome do arquivo devem ser excluídos. Note que os arquivos ZIP e tar (.zip,.gz,.tar) são carregados mesmo que não estejam especificados no padrão de inclusão. Para impor a exclusão de arquivos ZIP ou tar, eles teriam que ser especificados em um padrão de exclusão (veja o texto de ajuda para isso).",
    "harvestables.field.excludeFilePattern": "Excluir arquivos (expressão regular)",
    "harvestables.field.excludeFilePattern.help": "Esta configuração pode ser usada para filtrar que arquivos coletar. O filtro se aplica a arquivos em diretórios FTP, bem como a entradas em arquivos (ZIP/tar).  Quando configurado para uma expressão regular, o coletor irá deixar de ler qualquer arquivo com um nome de arquivo que corresponda à expressão. Exemplo: <pre>readme\\.txt|README|.*\\ jpg|.*\\ gif</pre> excluiria arquivos com nomes readme.txt, README assim como arquivos .jpg e .gif dos diretórios FTP ou arquivos ZIP/tar.",
    "harvestables.field.passiveMode": "Usar o modo passivo para transferências FTP?",
    "harvestables.field.passiveMode.help": "Quando definido passivo, em vez de ativo, o modo é usado para conexões FTP. Se o programa de coleta estiver funcionando dentro de um firewall restrito que bloqueia conexões de modo ativo FTP, habilitar essa configuração pode ajudar. Pode ser, no entanto, necessário alinhar este modo com o que o servidor FTP espera.",
    "harvestables.field.csvConfiguration": "Configuração do analisador CSV",
    "harvestables.field.csvConfiguration.help": "O programa de coleta (harvester) detectará (seja pelo tipo MIME ou por extensão de arquivo) e tentará analisar arquivos CSV (valores separados por ímamo) em uma representação XML para processamento posterior. A representação XML de cada linha de dados parece a seguinte: <pre>&lt;row&gt;&lt;dedo nome=&quot;nome da coluna ou número&quot;&gt;field valor&lt;/campo&gt;... &lt;/linha&gt;</pre> A menos que a opção de divisão em profundidade seja definida para > 0, todas as linhas serão analisadas em um único documento XML e empacotadas com um elemento raiz adicional &lt;rows&gt;. Para arquivos CSV grandes pode ser uma boa ideia definir a divisão em profundidade para 1.  A configuração do analisador é expressa em uma lista de chave/valor delimitada de ponto e vírgula, assim: key1=value1; key2=value2. A lista de opções suportadas é a seguinte: <ul> <li> charset: padrão \"iso-8859-1\", especifica a codificação de caracteres do</li> <li> delimitador de arquivos: padrão \",\" para CSV e \"\\t\" para TSV, especifica o delimitador de campo usado nos arquivos</li> <li> contém Header: padrão \"sim\", especifica se a primeira linha nos arquivos contém o cabeçalho da linha de cabeçalhoLine</li> <li> : sem padrão, permite substituir ou especificar cabeçalhos,  formato é uma lista separada por címula, por exemplo, cabeçalhos=\"título,autor,descrição\"</li></ul>",
    "harvestables.field.type.connector": "Informações específicas do conector",
    "harvestables.field.connectorEngineUrlSetting.label": "Motor CF",
    "harvestables.field.connectorEngineUrlSetting.label.help": "Selecione a instância da ferramenta de coleta que será usada para executar o trabalho de coleta do conetor. O \"motor\" padrão é hospedado pela Index Data, mas também pode ser instalado localmente no servidor usado pelo  cliente. Motores de conexão adicionais podem ser especificados através da guia Configurações.",
    "harvestables.field.engineParameters": "Parâmetros do motor (opcional)",
    "harvestables.field.engineParameters.help": "Valores adicionais ou personalizados dos parâmetros de sessão do motor de conexão usados por este trabalho. Veja \"CFWS manpage\" para mais informações.",
    "harvestables.field.connectorRepoUrlSetting.label": "Repositório CF",
    "harvestables.field.connectorRepoUrlSetting.label.help": "Selecione o repositório do conector onde os Conectores estão hospedados e mantidos. Normalmente, o Repositório do Conector é fornecido pelos Dados do Índice e pode exigir uma conta de login. As credenciais da conta são fornecidas diretamente na configuração de URL do Connector Repositório acessada na guia Configurações e devem ter o formulário: <pre>http(s)://&lt;repouser&gt;:&lt;repopass&gt;@url.to.the.repository</pre>.",
    "harvestables.field.connector": "Conector (tipo de sugestão)",
    "harvestables.field.connector.help": "Digite aqui o nome do conector de coleta específico para o recurso coletado. Este campo fornece sugestões procurando o Repositório para que apenas alguns caracteres iniciais ou uma parte do nome seja necessário.",
    "harvestables.field.overwrite-connector.help": "Marque esta opção para EXCLUIR todos os dados coletados anteriormente antes de iniciar a próxima execução programada (ou acionada manualmente).",
    "harvestables.field.connuser": "Nome de usuário",
    "harvestables.field.connuser.help": "Nome de usuário necessário para acesso a um recurso coletado que requer autenticação.",
    "harvestables.field.password": "Senha",
    "harvestables.field.password.help": "Senha necessária para acesso a um recurso coletado que requer autenticação.",
    "harvestables.field.proxy": "Endereço do servidor proxy",
    "harvestables.field.proxy.help": "Endereço do servidor proxy que deve ser usado pelo motor de coleta, por exemplo, para lidar com casos em que o recurso é autenticado por IP.",
    "harvestables.field.initData": "Dados Iniciais",
    "harvestables.field.initData.help": "Configuração avançada para fornecer parâmetros de inicialização adicionais ao conector de coleta. Qualquer nome de usuário/senha/senha/proxy especificado nas entradas acima terá precedência sobre as configurações especificadas neste campo. Estas configurações devem ser fornecidas no formato JSON.",
    "harvestables.field.startToken": "Token inicial (coleta incremental)",
    "harvestables.field.startToken.help": "O uso de um token inicial para a coleta incremental é específico do conector e depende da capacidade do conector. Esta configuração deve ser fornecida no formato JSON.",
    "harvestables.field.sleep": "Tempo de espera entre pedidos (em milissegundos)",
    "harvestables.field.sleep.help": "Atraso entre as solicitações feitas pelo programa de coleta (harvester) para o motor do conector. Use quando o recurso estiver sensível a cargas altas.",
    "harvestables.field.failedRetryCount": "Contagem de tentativa de falhas na solicitação",
    "harvestables.field.failedRetryCount.help": "Especifique quantas vezes o programa de coleta (harvester) deve tentar novamente as solicitações de coleta com falha, 0 desabilita totalmente a repetição.",
    "harvestables.field.type.status": "Informações gerais",
    "harvestables.field.usageTags": "Filtro: lista de etiquetas de uso separada por vírgulas",
    "harvestables.field.usageTags.help": "Usado para filtrar o relatório de status pelos grupos de usuários em clientes etiquetados para um trabalho de coleta (\"Usado por\").",
    "harvestables.field.adminTags": "Filtrar: lista de etiquetas de administrador separada por vírgula",
    "harvestables.field.adminTags.help": "Utilizado para filtrar o relatório de status pelo criador ou administrador do trabalho de coleta, como etiquetado para o trabalho de coleta (\"Gerenciado por\")",
    "harvestables.field.statusJobEnabled": "Status do trabalho habilitado",
    "harvestables.field.customMailAddresses": "Endereços de e-mail personalizados (vários separados por vírgula)",
    "harvestables.heading.status": "Informações de status",
    "harvestables.field.currentStatus": "Status atual:",
    "harvestables.field.initiallyHarvested": "Coleta inicial",
    "harvestables.field.lastHarvestStarted": "Última coleta inicida",
    "harvestables.field.lastHarvestFinished": "Última coleta concluída",
    "harvestables.field.lastUpdated": "Ultima atualização",
    "harvestables.field.message": "Mensagem da última coleta:",
    "harvestables.field.failedRecordsLogging.NO_STORE": "Não salvar registros de falhas",
    "harvestables.field.failedRecordsLogging.CLEAN_DIRECTORY": "Salve. Limpe o diretório primeiro",
    "harvestables.field.failedRecordsLogging.CREATE_OVERWRITE": "Salve. Substitua arquivos existentes",
    "harvestables.field.failedRecordsLogging.ADD_ALL": "Salve. Adicionar versões numeradas para arquivos existentes",
    "SENTINEL": "SENTINELA",
    "harvestables.field.jobClass": "Classe de trabalho",
    "harvestables.field.jobClass.oaiPmh": "OAI-PMH",
    "harvestables.field.jobClass.xmlBulk": "XML em lote",
    "harvestables.field.jobClass.connector": "Conector de coleta (harvesting)",
    "harvestables.field.jobClass.status": "Relatório de status",
    "harvestables.column.currentStatus.SHUTDOWN": "Desligar",
    "button.view-log": "Ver log",
    "summary-table.summary": "Sumário",
    "summary-table.instances": "Instância",
    "summary-table.holdings": "Coleção",
    "summary-table.items": "Item",
    "summary-label.processed": "Processado",
    "summary-label.loaded": "Carregado",
    "summary-label.deleted": "Excluído (ignorado)",
    "summary-label.failed": "Falhou",
    "failed-records.recordNumber": "Número do registro",
    "failed-records.timeStamp": "Carimbo de tempo",
    "failed-records.instanceHrid": "HRID da instância",
    "failed-records.instanceTitle": "Título da instância",
    "failed-records.errors": "Erros",
    "harvestables.column.logFile": "Arquivo de log",
    "harvestables.column.records": "Registros",
    "logs.countFailedRecords": "{count, number} {count, plural, one { registro com falha } other { registros com falha }}",
    "stats.instances": "Instâncias",
    "stats.holdings": "Coleção",
    "stats.items": "Itens",
    "nav.jobs": "Trabalhos",
    "nav.jobs-for": "Trabalhos para {name}",
    "button.old-jobs": "Trabalhos antigos",
    "logs.plainTextLog.running": "Log de texto simples em tempo real para o trabalho atual",
    "logs.plainTextLog.previous": "Log de texto simples para o último trabalho",
    "logs.plainTextLog.refresh": "Atualizar",
    "settings.storage": "Motores de armazenamento",
    "settings.pipeline": "Fluxos de transformação",
    "settings.step": "Etapas de transformação",
    "permission.all": "Administrador do Harvester: Todas as permissões",
    "filter.date.started": "Data de início",
    "filter.date.started.from": "De",
    "filter.date.started.to": "Para",
    "filter.date.finished": "Data de término",
    "filter.date.finished.from": "De",
    "filter.date.finished.to": "Para",
    "error.invalidSort.label": "Critério de classificação inválido",
    "error.invalidSort.content": "Não é possível ordenar na coluna <code>{name}</code> devido a limitações de implementação.",
    "jobs.index.name": "Nome coletável",
    "jobs.index.id": "ID",
    "jobs.index.harvestableId": "ID coletável",
    "jobs.index.message": "Mensagem",
    "jobs.index.all": "(Todos)",
    "jobs.column.name": "Nome coletável",
    "jobs.column.status": "Status",
    "jobs.column.amountHarvested": "Registros",
    "jobs.column.seconds": "Segundos",
    "jobs.column.started": "Iniciado",
    "jobs.column.finished": "Concluído",
    "jobs.column.type": "Classe de trabalho",
    "jobs.column.message": "Mensagem (processada/carregada/excluída (ignorada)/falhou)",
    "nav.records": "Registros com falha",
    "records.index.recordNumber": "Número do registro",
    "records.index.instanceHrid": "HRID da instância",
    "records.index.instanceTitle": "Título da instância",
    "records.index.errors": "Erros",
    "records.index.timeStamp": "Carimbo de tempo",
    "records.index.harvestableName": "Nome coletável",
    "records.index.all": "(Todos)",
    "filter.date.timeStamp": "Carimbo de tempo",
    "filter.date.timeStamp.from": "De",
    "filter.date.timeStamp.to": "Para",
    "failed-records.harvestableName": "Nome coletável",
    "button.view-log.current": "Log atual",
    "button.view-log.last": "Último log",
    "harvestables.column.oldJobs": "Trabalhos antigos",
    "selectValue": "Selecione um valor",
    "fillIn": "Por favor, preencha isto para continuar",
    "selectToContinue": "Por favor, selecione para continuar",
    "filter.numeric.records": "Registros",
    "filter.numeric.records.from": "Pelo menos",
    "filter.numeric.records.to": "Não mais do que",
    "settings.storage.heading": "Gerenciar mecanismos de armazenamento",
    "settings.pipeline.heading": "Gerenciar fluxos de transformação",
    "settings.step.heading": "Gerenciar etapas de transformação",
    "storage.field.name": "Nome",
    "storage.field.description": "Descrição",
    "storage.field.enabled": "Habilitado",
    "storage.field.url": "URL",
    "storage.field.json": "Configuração JSON",
    "storage.field.type": "Tipo de armazenamento:",
    "invalidJSON": "JSON inválido: {error}",
    "op.run.error": "Não foi possível iniciar o trabalho <b> {name} </b> : {error}",
    "op.stop.error": "Não foi possível interromper o trabalho <b>{name}</b>: {error}",
    "logs.plainTextLog.download": "Baixar",
    "pipeline.field.name": "Nome",
    "pipeline.field.description": "Descrição",
    "pipeline.field.enabled": "Habilitado",
    "pipeline.field.parallel": "Paralelo",
    "pipeline.field.stepAssociations": "Etapas de transformação",
    "pipeline.steps.position": "#",
    "pipeline.steps.name": "Nome",
    "pipeline.steps.in": "Em",
    "pipeline.steps.out": "Fora",
    "pipeline.steps.actions": "Ações",
    "step.field.name": "Nome",
    "step.field.description": "Descrição",
    "step.field.enabled": "Habilitado (Isto não é usado)",
    "step.field.type": "Tipo",
    "step.field.inputFormat": "Formato de entrada",
    "step.field.outputFormat": "Formato de saída",
    "step.field.script": "Roteiro",
    "step.field.testData": "Dados de teste",
    "step.field.testOutput": "Saída de teste",
    "step.field.customClass": "Classe personalizada",
    "harvestables.field.statusJobEnabled.help": "Ajuda",
    "harvestables.field.customMailAddresses.help": "Ajuda",
    "set-to-xml2json": "Escolha XML-para-JSON",
    "export-csv": "Exportar em CSV",
    "invalidXML": "XML inválido: {error}",
    "invalidXSLT": "XML válido, mas não é uma folha de estilo XSLT",
    "validXSLT": "Folha de estilo XSLT válida",
    "reports": "Relatórios",
    "transform": "Transformar",
    "nav.mike": "Mike",
    "permission.settings.view": "Harvester admin (Settings): View storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit": "Harvester admin (Settings): View, edit storage engines, transformation pipelines and transformation steps, and log-file deletion threshold",
    "permission.settings.view-edit-create": "Harvester admin (Settings): View, edit, create storage engines, transformation pipelines and transformation steps",
    "permission.settings.view-edit-create-delete": "Harvester admin (Settings): View, edit, create, delete storage engines, transformation pipelines and transformation steps",
    "permission.harvestables.view": "Harvester admin: View harvestables",
    "permission.harvestables.view-edit": "Harvester admin: View, edit harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create": "Harvester admin: View, edit, create harvestables, start/stop jobs",
    "permission.harvestables.view-edit-create-delete": "Harvester admin: View, edit, create, delete harvestables, start/stop jobs",
    "permission.jobs-and-failed-records.view": "Harvester admin: View jobs and failed records"
}